#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/imagebuilder/imagebuilder-staging/runs/run-oriQms8qajXDECPh

Waiting for the plan to start...

Terraform v0.14.0
Configuring remote state backend...
Initializing Terraform configuration...
aws_cloudwatch_log_group.pozorbot_cloudwatch_logs: Refreshing state... [id=/aws/lambda/pozorbot_staging]
aws_s3_bucket.imagebuilder_s3: Refreshing state... [id=imagebuilder.service.staging]
aws_cloudwatch_log_group.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_user.imagebuilder_worker: Refreshing state... [id=imagebuilder_worker_staging]
aws_sqs_queue.image_builder_pozorbot: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/933752197999/image-builder-pozorbot-staging]
aws_iam_user.packer: Refreshing state... [id=packer_staging]
aws_cloudwatch_log_group.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_role.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_role.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_iam_policy.packer: Refreshing state... [id=arn:aws:iam::933752197999:policy/packer_staging]
aws_iam_policy.spotfleet_iam_spot_policy: Refreshing state... [id=arn:aws:iam::933752197999:policy/spotfleet_iam_spot_policy_staging]
aws_iam_role.spot_fleet_tagging_role: Refreshing state... [id=imagebuilder_spot_fleet_role_staging]
aws_iam_role.pozorbot_lambda_role: Refreshing state... [id=pozorbot_lambda_role_staging]
aws_iam_role.external_worker: Refreshing state... [id=external_worker_staging]
aws_iam_role.external_composer: Refreshing state... [id=external_composer_staging]
aws_cloudwatch_log_stream.external_composer_syslog: Refreshing state... [id=external_composer_syslog]
aws_iam_policy.vmimport_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_s3_staging]
aws_iam_policy.vmimport_ec2: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_ec2_staging]
aws_iam_role.vmimport: Refreshing state... [id=vmimport_staging]
aws_cloudwatch_log_stream.internal_composer_syslog: Refreshing state... [id=internal_composer_syslog]
aws_iam_instance_profile.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_vpc_endpoint.external_vpc_s3: Refreshing state... [id=vpce-0249da6b762fae5de]
aws_iam_policy.pozorbot_lambda_sqs: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_lambda_sqs_staging]
aws_iam_instance_profile.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_security_group.external_workers: Refreshing state... [id=sg-0f578bf2872026f5d]
aws_security_group.internal_allow_trusted: Refreshing state... [id=sg-084607083aaa39727]
aws_security_group.internal_allow_egress: Refreshing state... [id=sg-0eb65fd8f2c17dba5]
aws_vpc_endpoint.internal_vpc_s3: Refreshing state... [id=vpce-08d5fdb7cd26e5c94]
aws_iam_policy.pozorbot_client_sqs: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_client_sqs_staging]
aws_iam_role_policy_attachment.spotfleet_iam_role_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656385800000003]
aws_security_group.external_vpc_endpoints: Refreshing state... [id=sg-0be443e4c92c98b1c]
aws_iam_user_policy_attachment.packer: Refreshing state... [id=packer_staging-20201204204656365500000001]
aws_iam_role_policy_attachment.spotfleet_iam_spot_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656553800000004]
aws_iam_instance_profile.external_worker: Refreshing state... [id=external_worker_staging]
aws_lambda_function.pozorbot_lambda: Refreshing state... [id=pozorbot_staging]
aws_iam_instance_profile.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_policy.pozorbot_lambda_cloudwatch: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_lambda_cloudwatch_staging]
aws_iam_policy.internal_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_worker_read_keys_staging]
aws_iam_policy.internal_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_composer_read_keys_staging]
aws_iam_policy.external_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_composer_read_keys_staging]
aws_iam_policy.pozorbot_read_secrets: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_read_secrets_staging]
aws_iam_policy.external_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_worker_read_keys_staging]
aws_iam_role_policy_attachment.vmimport_s3: Refreshing state... [id=vmimport_staging-20210121192044923500000001]
aws_iam_user_policy_attachment.imagebuilder_vmimport: Refreshing state... [id=imagebuilder_worker_staging-20210121192045197600000002]
aws_iam_role_policy_attachment.vmimport_ec2: Refreshing state... [id=vmimport_staging-20210121192045244900000003]
aws_iam_policy.external_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_cloudwatch_logging_staging]
aws_iam_role_policy_attachment.pozorbot_lambda_sqs: Refreshing state... [id=pozorbot_lambda_role_staging-20210127130509124000000001]
aws_security_group.external_composer: Refreshing state... [id=sg-0be4cfbfac3cc0022]
aws_iam_role_policy_attachment.internal_pozorbot_worker: Refreshing state... [id=internal_composer_staging-20210127152215216300000001]
aws_iam_role_policy_attachment.external_pozorbot_worker: Refreshing state... [id=external_composer_staging-20210127152215237300000002]
aws_iam_role_policy_attachment.internal_pozorbot_composer: Refreshing state... [id=internal_worker_staging-20210127152215241500000004]
aws_iam_role_policy_attachment.external_pozorbot_composer: Refreshing state... [id=external_worker_staging-20210127152215239700000003]
aws_vpc_endpoint.external_vpc_cloudwatch_logs: Refreshing state... [id=vpce-0ffb71834c608a4e5]
aws_vpc_endpoint.external_vpc_secretsmanager: Refreshing state... [id=vpce-013676c2939c3d681]
aws_iam_role_policy_attachment.pozorbot_lambda_cloudwatch: Refreshing state... [id=pozorbot_lambda_role_staging-20210127132820714600000001]
aws_vpc_endpoint.internal_vpc_secretsmanager: Refreshing state... [id=vpce-0d13154306549b1cd]
aws_iam_policy.internal_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_cloudwatch_logging_staging]
aws_vpc_endpoint.internal_vpc_cloudwatch_logs: Refreshing state... [id=vpce-01e031ba5033ab0c5]
aws_iam_role_policy_attachment.internal_worker_read_keys: Refreshing state... [id=internal_worker_staging-20201204204656366800000002]
aws_iam_role_policy_attachment.internal_composer_read_keys: Refreshing state... [id=internal_composer_staging-20201204204656559200000005]
aws_iam_role_policy_attachment.external_worker_read_keys: Refreshing state... [id=external_worker_staging-20210113202541913700000002]
aws_iam_role_policy_attachment.external_composer_read_keys: Refreshing state... [id=external_composer_staging-20210113202541907800000001]
aws_lambda_event_source_mapping.pozorbot_sqs: Refreshing state... [id=7ae0421e-5c59-4b9e-971a-aab448662f51]
aws_iam_role_policy_attachment.pozorbot_lambda_secrets: Refreshing state... [id=pozorbot_lambda_role_staging-20210127150546817300000001]
aws_iam_policy.imagebuilder_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder_workers_s3_staging]
aws_ebs_volume.composer_external: Refreshing state... [id=vol-0daeecfc25da04a05]
aws_iam_role_policy_attachment.external_cloudwatch_worker: Refreshing state... [id=external_composer_staging-20210113203644029600000002]
aws_iam_role_policy_attachment.external_cloudwatch_composer: Refreshing state... [id=external_worker_staging-20210113203644009900000001]
aws_network_interface.composer_external: Refreshing state... [id=eni-02f250427cdd85dc7]
aws_iam_role_policy_attachment.internal_cloudwatch_worker: Refreshing state... [id=internal_composer_staging-2020120420465704340000000a]
aws_ebs_volume.composer_internal: Refreshing state... [id=vol-058d1cec56397f102]
aws_network_interface.composer_internal: Refreshing state... [id=eni-07088640399f60f49]
aws_iam_role_policy_attachment.internal_cloudwatch_composer: Refreshing state... [id=internal_worker_staging-2020120420465704850000000b]
aws_iam_user_policy_attachment.imagebuilder_s3: Refreshing state... [id=imagebuilder_worker_staging-2020120420465705150000000c]
aws_eip.lb: Refreshing state... [id=eipalloc-0f8be222c563c4767]
aws_instance.composer_external: Refreshing state... [id=i-0351a00a6c8e78e4f]
aws_instance.composer_internal: Refreshing state... [id=i-029e28b87a6e5ad32]
aws_volume_attachment.composer_internal: Refreshing state... [id=vai-4287198256]
aws_launch_template.worker_internal_x86: Refreshing state... [id=lt-0a23e96f3feb1649c]
aws_volume_attachment.composer_external: Refreshing state... [id=vai-2791961468]
aws_launch_template.worker_external_x86: Refreshing state... [id=lt-0195b4ef20679c780]
aws_spot_fleet_request.workers_internal_x86: Refreshing state... [id=sfr-efe331f8-621f-4e5e-a877-70c53606e343]
aws_spot_fleet_request.workers_external_x86: Refreshing state... [id=sfr-c97e566a-9631-467b-af70-d2b5ac0e4b93]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_cloudinit_config.external_workers_cloud_init will be read during apply
  # (config refers to values not yet known)
 <= data "template_cloudinit_config" "external_workers_cloud_init"  {
      ~ id            = "168553545" -> (known after apply)
      ~ rendered      = "H4sIAAAAAAAA/9RZ6XLjOH7/rqp5B8Tj1OxWhxIPSba866kVJVInKYmnqE3KBYKQSBEEaRI6e/tF8iVf83h5hBR1uGV3z+yRrUqNv7QI/C/88D/RnZQyTBlnHTL8BJINYVEGc1ZLoj0O/gD8dEMDmB+e77SBpsgTW++2De+uUn5xDs6LKKVPQKjyP1R+qHDcLdEPlavsblRkaRGxEy1kDKIwwZT9ASwjgilM8PNdRCNWRcvV3VcuK4e0WOKcUyhKg4iunsCDH7EbgpPJDO9ZDZF0E3Aopcto9UNFixL8jXE/3tJUKpsC58VTBQAOlBY8AYxErlysAABAUYQvcMPCNI+OOHiJ8eFEW/5x4K4oQi4vIGi3221Z0o+wIxyQqJSf3fasLbfb7U571tmvl+pgQHrLDm1FiPQPiZsrcm7ZIhk3WWz2LAFnD0FnetwJa6/p0nBGpnMtw9M80vf6nPQekTtp1Qw1kwP+2FJ3+uFTvFyFreXmoHv11uCTBpuTg+XIq0aop+p+acx7jajPUM2cEeorajTKzLhOoiytzxZMZsmq/bqKzXazewwPK7+5aWitaG8N9nVXXm9Mje/NZ0d9neHlIXI3n4qB8SkU7XwWj9ryZjPwZn6+Jp/U0EngeJtvD9ZE3BQTtqWevA796e4weRDd6Rpmo6DWCi34OlWEnXpo2qpI56g+Xe34VTTzm0Xkq9bxQbfw3pUas9bjazabuJo3QtlqkRMT9vujhamF7Dh50IJFPhmr9jw1hTZuH+qrkCE9n8gW8RvmdvogHY/8q2yoIupM6hN+lzV2u9dpuN2JlPlSZo2nLMBs+Mlp8LMpzej8YJp0kYlHdYewKPjzffOBhi1Cw3G+WK3xA0pndNpW9zVEpKZiDg+raDNF8u5TLDx6G+Jpc/sVyizeDcexse5ma2su4oY2FJpp96EY9lG95jbiw3K8DbTCCYNXoTPv9xxnkh3Tlc+3Go4X8cZczejCqAnYWXVqxifXOTBv6T3y+dKZoKCdir3Fkg4bR8+w58NhS1vEkO73kvJgT6JYGeqtwl6LPH9sdg4HfrAcvFr+UJAby4dlIEFk5ON6F3l2oA5qgnzQ3aYqrB/QImr3JsOR7h/nKm9JbPm457Ewe34GCVyn+Z9yHISQVVGa3L33dxyIjYbQOvl85+zzZNEdCLqlNMq1wVQW1iqpZ03VkqN932ruJnFz/kjXtcUDTqf6TKlp/G5Uf2yMQOpvAhi9U1bZ5RHDL2VGuIRlBln4BGosyc7h/VLmiJctzIuTZeicBZ7AXy6GTkzZHoy7L52Jpg2s50cJweUjz+OG2BDrfl2oLx+WDX/ZgJgPJNQSRPTYElrihbsz0aYTUzGu7A/LBpaaQdCqPwoNfglR3eelptREzUBq+f5DE4v4UQiWH5W3XzqKYT2PTZ6NTaFj2MHQiuSu4Qxt014MZ7xqG6c9nnViYWjahuIoenfmLuYLXpVMeygveOLYXX2mid5Rd+SeHTcEX1zwONEaVjcWjV5o+6IhB7xhuHY29oVsCPuLtRWrhmHvRjOiygG/eDUcR5/FpD+zVMewVSng95HGN7KFGhRIyLr6fLH2XV0ye+HaioXX2TyYOorTtBxjgW1BcSx9Dnv6xJpncrDLyr36u71YnVvO0Ah4h7q24dqOqhiKygeJdjDXauhIYW71+AZ2suaM12WbJ5KhqgszZls3JmmQ6JPOyeZhx7ZVZSEGqq2oyonWbXXL71ms6jMq566jeqaja94xHLtuptsOoZjKxsTWZU0YjrUkGBhdee/N1WOwXo08Z7h2Yk3UidZYxOHesO09tPeOqzxKWndo4LVzhGKWalK2t/qkb69DySbedizqQ80d7NFadrCTWR6/h5qAJMfJDrNdyutdI/Gk9GjNSd1X9aYjOAtbkOksJmPYC+RJX2WIZKbmthLPNQ6475hWhx39eKGYLqtrEsq9ozpaOM5GS/RCU4OsQxze7Q77hrDoGiTQLVHdLmIjd1Wna1BnbPaDke0GPatvHE1Fh66rJwEJXFPNoB7X6wEf7DSiQtcaNLxjKPhz+VVz2iNbWRSuotUXPRVaihC6KokMS9bNueFqij4wqSwZPNl5lGx8h9h+hx0N6oh+19g6PeGA++kWz8MmUgzRiYUpitWhP8vqvlhIiDjM6Tux0XNUWxh2LDGQNZsJni2YTt8Jzbls+Mdh7EuL/ejY3huJd5zZ9YNj63LAO/LMVSeOIvSMeTCwHaJ0yMLUlFZnRohqxKm0sBaeJsW7Ra9VILM18sgi82KSBaKxsYV2rsdCZ6IEsuY4sTkPDNcWOp6t9sx1QHSyOmJLjn1xN/oFXvnKa8wDdRa1JNte6DNb6Mxcr/79uNq/+ehslckGzURdJMTkUcNXszGKBwfLFSBU1L2pEA27+9CSiIssJBlH0rGcoW1QfedSm9f6A8kQDMnjjTRIVoJh61tTVaNOss8DS/Z0u+UteEN0+3oH9Vo9sz8UNYVNTXdv6YIz0ubeTu8VW5MQ6vZR7vcy2+lr28k82/nr0HSSPUN9e2vwwtSy7JHtDvt2h03g2oHo6CQGv5hDpS5Z1kCwXeZMusOR3w+JGauFPQ8HM3HftXtO3Y513bPUhj5vS06vQSddeWySgMeOPJvMMt4WA31G25LuOObCfeR1267bSnYwafsI+2Srq8P6xBkahsgO2NVNcx4kszgUoRTqZrLYIFGTXLMl6i4RjHXIsCI0O2ud9+K0MeKzhmGrgtlP914cCMjWvZGkjmzHsINOy/CP3iGIg7lnxw1bWIw9otU9J9Rmx+FEp+oausM9Wtv1xdpQzHg2MqleWOajhPp6A63VrT43eC8ebnQSC7O51upE55xs2A1loOiqTYyhEZPuzDHUcy7nRx8rRX9iWs9wV5QFLEsLnFfTwt9EJKim+eojcbvbNRTTfBYexKokVJv1qiBcaNyJMVKMF9Mcv4wUz3xpG/ozzOkT3BVPBUY5ZkUCKVzh/GlTcBgWjBOeWpL00BCF1kOr1bpQPfk53p16Ve5BtTEmF/mmLZsdYzC1BhP9RWvr7d6lzLX17j+urNj4BcqjrOzquQsLh9IkgTTg4plH0tZVv2dainaCS29rysvUUNTB/LlgcBXRFYf3DOcUEm6X5vGl/74BrjswnmuYodoFXO6K9lW60jEUy3w7mKJ3p5OBbr3Yxvg5ZCwrnmq19yervp2sChN4TOnlEmu3fcf3VH6zUGVpQr7fjvw5TtfRf1w+ICHpDgcvQZrAiBbgGfwZ3DEMk1uXufs3cBdu/Gp5jR/Xz9h8uwWuGhAEz+Du+1YjyKGcVTNc9lkX684C/277/ml2fEA6SWnEcvR9KH8EWrkNzrPbJoelz4FlmoNBAlcYyKUanIOIgrZrVt+4uikqnsDVB5KTjtM9n37VghRtyjn0JO68Vg1ZQipvAjohRjHAW5wfgMSDAqOUBgWANAAkXQGWguJQkHR1VVlgBgKIk5QCib9ZK4nPlF9lt0vIAUQIFwXYRrCcOQHbUIrJSTDGgIUYJNeTFynBt3rKYwUgS3MGxEdBLI267JZ/mwIDGAR5KZykCJIwLdjNPjxrD5KIPp1UfDXMwXm0PAAWQgZ2+KccA5oygCGL6KrkO5uFkzQ/gJSeviJaMEjRm32dvtIZXeIe3JeB/6Y6Wl55N0V5dz+Dh8a/3hhW3moDoAMiuLhZZiGmAO8xArVNkddOR6r5Ea1l6THN/ZS9QILzm1MotNjkZwjzNGWnp4biUDCcgKigPzGw3BDy3l51MFYuNp9Ypm2rD2q3lhcZRPjN8Ef+W8NZlLyzexexMKJA+Gcc6eyNF9+IlmCHAYIU5BiiEKCAVr/OU19jQJ9Yyu+SEB4CTH//BFwMdhEhAJIdPBRghRmAoM5LIMQ5Bj5GsPScdAkQiTBlAOGcFe9hKq8T5CEmLyigwB1YfXApbh+MuEVuCSOCbx00i+jqHwDjV0WWsVCvS7dLecpSlJJzErjZKBhkmzLP1Xnpw3WBoiAgPdW1AnwGnXY50A3UQadtKaWLXDJWHhZJDcHa+bzcBmdlYgNf/qFDveXCv3r4b5Pjv5xIfViEb5duYhqAE09R+stVTPV9Pv2pAJhuozylZRYEW5hH0Ce4ADDH4JoccXByjac31r87nf6o6M7AmOiaoltXZ57Ziq28q9CvG7zBH8rxbdtRi8pUz/nnVM9dj8RduoiLXE0xzXZPeb77n//6z/8G99pEH1gv5YBtneLzsmAqhjPoKGX2uqycfBqy62e3bSnX9w9DMe2x9Xz/O7grQPFagALTgEtwccoCHHcynNvkBNy/nQpwVwLOT4MDuLu/GHb3+4tUjMIU3J9lVyr5hqIkOD97oDBJA/Bp/zf4zJmUf+D5j0WUA+dchxgBmJa3CjiOprtzOfmVp9q/59F1zxUhJuTcBf7Sq+uNd5ZVi8ObFGRRhsvorRTpJkf4+288lR9BD7N35QUMutXKQDettt5RXgbd5/vfoRJ4blyc3PKpVhOararYqFcv/9YIZLhgtQQzyAWQwdpVFhcFvy91tIsCJyU+ZYGkMMHVimqPx2/d6vPd/efvN7BfuPvPN8Z8uSvFTfOIMpBuzoZTvLuRe7rzOxOzUyW9FKPrdhmn95/fqf5SPYk0Lyh8YKhWrr/KSy4w495E3b8T89u47Qs456HCLwF6u3WWAqOvn8Ew8CoqGM7f+8UpbZc0lQ9Bc4rZd71/WfK48xK3hWSDwb+X8cJhGmRpRNk5kj//2lTx5cJykRIFJf1fmbG+gL+A9SvgcnBXNU98JssjuroDP58BuR2nXi62vlzGqeq6SGnlyv5rlHd/ozDwF3C6pDwB3PJvNaDyvZHv8v85gOPghqW/JV/r4oykB1DOy6ficB5tirOfXTZLL7uOL6DTPrVD0TJCkOFqxYcFbtYBFwAO/PGPfwT3nz+8An8BP4P7z7eT7JebGeiX1MT4cJow3un6//Lr77xN/FVXPgN5eoh477lfN+6+T3l2yzdQv0XvzMDF+HBC8INglLP/o+Dr1dzExTen+e25+Kk5KKvDdxy9rC6b7Iak8iOwJt3J+5mBYhyUeRildIvzsh5Fp86yq5ugLLE52JW97g4DAjcUhdUKguwUFHc3SF/GhC+36JdV6ssd+PnnWxN+QxBfy/kmu+AKCpxvI4Qv+E5znJX99MfHkJ8KkOMkZfgj2yn2ixTFuBy8fqGNu0o7i7i8nP3pI6xPjw88/w2YHPdD5X8DAAD//7q77132HwAA" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ part {
          ~ content      = <<-EOT
                #cloud-config
                
                users:
                  - name: ec2-user
                    ssh_authorized_keys:
                      - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                      - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
                
                write_files:
                  - path: /tmp/cloud_init_vars
                    content: |
                      OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                      COMPOSER_COMMIT=7f5e36dd948150fac4b03636c6d39bb76e2e81df
                      OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                      COMPOSER_HOST=aws.composer.osbuild.org
                      COMPOSER_ADDRESS=172.31.64.11
                      WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:brew_keys-7FUeel
                      SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                      SYSTEM_HOSTNAME_PREFIX=staging-external-worker
                      COMPOSER_DIR=/etc/osbuild-composer
                      SECRETS_MANAGER_ENDPOINT_URL=https://secretsmanager.us-east-1.amazonaws.com/
                  - path: /etc/osbuild-composer/osbuild-composer.toml
                    content: |
                      [koji]
                      allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
                
                      [worker]
                      allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
                  - path: /etc/monitrc
                    content: |
                      # Monit configuration for Image Builder in AWS.
                      # Docs: https://mmonit.com/monit/documentation/monit.html
                
                      # Check every 30 seconds and log to syslog.
                      set daemon 30
                      set log syslog
                
                      # Allow access via ssh tunnel to see the monit console.
                      set httpd port 2812 and
                          use address localhost
                          allow admin:monit
                
                      # Verify that we're not eating all the memory on the instance.
                      CHECK SYSTEM $HOST
                        if memory usage > 75%
                          for 5 cycles
                          then exec /usr/local/bin/pozorbot_alert
                
                      # Ensure the root filesystem isn't full.
                      CHECK FILESYSTEM root PATH /
                        if space usage > 80%
                          for 5 times
                          within 15 cycles
                          then exec /usr/local/bin/pozorbot_alert
                
                      # Check to see if we can reach cdn.redhat.com.
                      # NOTE(mhayden): We will always get a 403 here because of client certs.
                      CHECK HOST rhel_cdn WITH ADDRESS cdn.redhat.com
                        if failed
                          ping
                          then exec /usr/local/bin/pozorbot_alert
                        if failed
                          port 443
                          protocol https
                          status = 403
                          with ssl options { CACERTIFICATEFILE: /etc/rhsm/ca/redhat-uep.pem }
                          then exec /usr/local/bin/pozorbot_alert
                  - path: /usr/local/bin/pozorbot_alert
                    content: |
                      #!/bin/bash
                      # Send alerts to pozorbot.
                      # Monit's environment variables are documented here:
                      # https://mmonit.com/monit/documentation/monit.html#ENVIRONMENT
                
                      QUEUE_URL=https://queue.amazonaws.com/933752197999/image-builder-pozorbot-staging
                      MESSAGE="🚨 $MONIT_EVENT for $MONIT_SERVICE on $MONIT_HOST at $MONIT_DATE"
                      RESULT=$(aws sqs send-message --queue-url $QUEUE_URL --message-body "$MESSAGE")
                      echo $RESULT
                
                runcmd:
                  - chmod +x /usr/local/bin/pozorbot_alert
                  - chmod 0700 /etc/monitrc
                  - systemctl enable --now monit
            EOT -> (known after apply)
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
    }

  # data.template_cloudinit_config.internal_workers_cloud_init will be read during apply
  # (config refers to values not yet known)
 <= data "template_cloudinit_config" "internal_workers_cloud_init"  {
      ~ id            = "1569940874" -> (known after apply)
      ~ rendered      = "H4sIAAAAAAAA/9RZ6XLjOH7/rqp5B8Tj1OxWhxIPSba866kVJVInKYmnqE3KBYKQSBEEaRI6e/tF8iVf83h5hBR1uGV3z+yRrUqNv7QI/C/88D/RnZQyTBlnHTL8BJINYVEGc1ZLoj0O/gD8dEMDmB+e77SBpsgTW++2De+uUn5xDs6LKKVPQKjyP1R+qHDcLdEPlavsblRkaRGxEy1kDKIwwZT9ASwjgilM8PNdRCNWRcvV3VcuK4e0WOKcUyhKg4iunsCDH7EbgpPJDO9ZDZF0E3Aopcto9UNFixL8jXE/3tJUKpsC58VTBQAOlBY8AYxErlysAABAUYQvcMPCNI+OOHiJ8eFEW/5x4K4oQi4vIGi3221Z0o+wIxyQqJSf3fasLbfb7U571tmvl+pgQHrLDm1FiPQPiZsrcm7ZIhk3WWz2LAFnD0FnetwJa6/p0nBGpnMtw9M80vf6nPQekTtp1Qw1kwP+2FJ3+uFTvFyFreXmoHv11uCTBpuTg+XIq0aop+p+acx7jajPUM2cEeorajTKzLhOoiytzxZMZsmq/bqKzXazewwPK7+5aWitaG8N9nVXXm9Mje/NZ0d9neHlIXI3n4qB8SkU7XwWj9ryZjPwZn6+Jp/U0EngeJtvD9ZE3BQTtqWevA796e4weRDd6Rpmo6DWCi34OlWEnXpo2qpI56g+Xe34VTTzm0Xkq9bxQbfw3pUas9bjazabuJo3QtlqkRMT9vujhamF7Dh50IJFPhmr9jw1hTZuH+qrkCE9n8gW8RvmdvogHY/8q2yoIupM6hN+lzV2u9dpuN2JlPlSZo2nLMBs+Mlp8LMpzej8YJp0kYlHdYewKPjzffOBhi1Cw3G+WK3xA0pndNpW9zVEpKZiDg+raDNF8u5TLDx6G+Jpc/sVyizeDcexse5ma2su4oY2FJpp96EY9lG95jbiw3K8DbTCCYNXoTPv9xxnkh3Tlc+3Go4X8cZczejCqAnYWXVqxifXOTBv6T3y+dKZoKCdir3Fkg4bR8+w58NhS1vEkO73kvJgT6JYGeqtwl6LPH9sdg4HfrAcvFr+UJAby4dlIEFk5ON6F3l2oA5qgnzQ3aYqrB/QImr3JsOR7h/nKm9JbPm457Ewe34GCVyn+Z9yHISQVVGa3L33dxyIjYbQOvl85+zzZNEdCLqlNMq1wVQW1iqpZ03VkqN932ruJnFz/kjXtcUDTqf6TKlp/G5Uf2yMQOpvAhi9U1bZ5RHDL2VGuIRlBln4BGosyc7h/VLmiJctzIuTZeicBZ7AXy6GTkzZHoy7L52Jpg2s50cJweUjz+OG2BDrfl2oLx+WDX/ZgJgPJNQSRPTYElrihbsz0aYTUzGu7A/LBpaaQdCqPwoNfglR3eelptREzUBq+f5DE4v4UQiWH5W3XzqKYT2PTZ6NTaFj2MHQiuSu4Qxt014MZ7xqG6c9nnViYWjahuIoenfmLuYLXpVMeygveOLYXX2mid5Rd+SeHTcEX1zwONEaVjcWjV5o+6IhB7xhuHY29oVsCPuLtRWrhmHvRjOiygG/eDUcR5/FpD+zVMewVSng95HGN7KFGhRIyLr6fLH2XV0ye+HaioXX2TyYOorTtBxjgW1BcSx9Dnv6xJpncrDLyr36u71YnVvO0Ah4h7q24dqOqhiKygeJdjDXauhIYW71+AZ2suaM12WbJ5KhqgszZls3JmmQ6JPOyeZhx7ZVZSEGqq2oyonWbXXL71ms6jMq566jeqaja94xHLtuptsOoZjKxsTWZU0YjrUkGBhdee/N1WOwXo08Z7h2Yk3UidZYxOHesO09tPeOqzxKWndo4LVzhGKWalK2t/qkb69DySbedizqQ80d7NFadrCTWR6/h5qAJMfJDrNdyutdI/Gk9GjNSd1X9aYjOAtbkOksJmPYC+RJX2WIZKbmthLPNQ6475hWhx39eKGYLqtrEsq9ozpaOM5GS/RCU4OsQxze7Q77hrDoGiTQLVHdLmIjd1Wna1BnbPaDke0GPatvHE1Fh66rJwEJXFPNoB7X6wEf7DSiQtcaNLxjKPhz+VVz2iNbWRSuotUXPRVaihC6KokMS9bNueFqij4wqSwZPNl5lGx8h9h+hx0N6oh+19g6PeGA++kWz8MmUgzRiYUpitWhP8vqvlhIiDjM6Tux0XNUWxh2LDGQNZsJni2YTt8Jzbls+Mdh7EuL/ejY3huJd5zZ9YNj63LAO/LMVSeOIvSMeTCwHaJ0yMLUlFZnRohqxKm0sBaeJsW7Ra9VILM18sgi82KSBaKxsYV2rsdCZ6IEsuY4sTkPDNcWOp6t9sx1QHSyOmJLjn1xN/oFXvnKa8wDdRa1JNte6DNb6Mxcr/79uNq/+ehslckGzURdJMTkUcNXszGKBwfLFSBU1L2pEA27+9CSiIssJBlH0rGcoW1QfedSm9f6A8kQDMnjjTRIVoJh61tTVaNOss8DS/Z0u+UteEN0+3oH9Vo9sz8UNYVNTXdv6YIz0ubeTu8VW5MQ6vZR7vcy2+lr28k82/nr0HSSPUN9e2vwwtSy7JHtDvt2h03g2oHo6CQGv5hDpS5Z1kCwXeZMusOR3w+JGauFPQ8HM3HftXtO3Y513bPUhj5vS06vQSddeWySgMeOPJvMMt4WA31G25LuOObCfeR1267bSnYwafsI+2Srq8P6xBkahsgO2NVNcx4kszgUoRTqZrLYIFGTXLMl6i4RjHXIsCI0O2ud9+K0MeKzhmGrgtlP914cCMjWvZGkjmzHsINOy/CP3iGIg7lnxw1bWIw9otU9J9Rmx+FEp+oausM9Wtv1xdpQzHg2MqleWOajhPp6A63VrT43eC8ebnQSC7O51upE55xs2A1loOiqTYyhEZPuzDHUcy7nRx8rRX9iWs9wV5QFLEsLnFfTwt9EJKim+eojcbvbNRTTfBb4qsRXhceqIFxI3IkxUowX0xy/jBTPfGkb+jPM6RPcFU8FRjlmRQIpXOH8aVNwGBaME55akvTQEIXWQ6vVulA9+TnenVpV7kG1MSYX+aYtmx1jMLUGE/1Fa+vt3qXKtfXuP66s2PgFyqOsbOq5CwuH0iSBNODimUfS1lW/Z1qKdkJLb2vKy9RQ1MH8uWBwFdEVF1GGcwoJt0vz+NJ+3+DWHRjPNcxQ7YItdwX7Kl3pGIplvh1M0bvTyUC3Xmxj/BwylhVPtdo2Q5jjA0ESGnWJbzbqLV9AAdc67vOHY2NbfX/y6tvJqyVjFSbwmNLLRddue5Pv2fXNQpWlCfl+y/LnOF1H/3H5gISkOxy8BGkCI1qAZ/BncMcwTG7d6u7fwF248avlXX9cPwP47Ra4akAQPIO771uNIIdyVs1w2YtdrDsL/Lvt+6fZ8QHpJKURy9H3ofwRaOU2OM93mxyWjgmWaQ4GCVxhIJdqcA4iCtquWX3j6qaoeAJXR0lOOk73fPpVC1K0KWfVk7jzWjVkCam8CeiEGMUAb3F+ABIPCoxSGhQA0gCQdAVYCopDQdLVVWWBGQggTlIKJP5mrSQ+U36V3S4hBxAhXBRgG8FyLgVsQykmJ8EYAxZikFxPXqQE3+opjxWALM0ZEB8FsTTqslv+bQoMYBDkpXCSIkjCtGA3+/CsPUgi+nRS8dUwB+fR8gBYCBnY4Z9yDGjKAIYsoquS72wWTtL8AFJ6+opowSBFb/Z1+kpndEkO4L7MDm+qo+WVd1OUd/czeGj8641h5a02ADoggoubZRZiCvAeI1DbFHntdKSaH9Falh7T3E/ZCyQ4vzmFQotNfoYwT1N2eo4oDgXDCYgK+hMDyw0h7+1VB2PlYvOJZdq2+qB2a3mRQYTfDH/kvzWcRck7u3cRCyMKhH/Gkc7eePGNaAl2GCBIQY4hCgEKaPXrzPU1BvSJpfwuCeEhwPT3T8DFYBcRAiDZwUMBVpgBCOq8BEKcY+BjBEvPSZcAkQhTBhDOWfEepvI6QR5i8oICCtyB1QeXAvjBiFvkljAi+NZBs4iu/gEwflVkGQv1unS7lKcsRSk5J4GbjYJBtinzXJ2XPlwXKAoC0lPxK8Bn0GmXQ99AHXTallK6yCVj5WGR1BCsnc/LbXBWJjbw5R861Fsu/KuH/zY5/suJ1IdF+HbpJqYBOPEUpb9cxVTf59OfCoDpNspTWmZBsIV5BH2CCwBzDK7JEQcn13h6Y/270+mPiu4MjImuKbp1deaZrdjKuzL+usGbj+X4tjepRWWq5/xzqueuR+IurcZFrqaYZrunPN/9z3/953+De22iD6yXcgi3TvF5WTAVwxl0lDJ7XVZOPg3Z9bPbtpTrG4mhmPbYer7/HdwVoHgtQIFpwCW4OGUBjjsZzm1yAu7fTgW4KwHnp8EB3N1fDLv7/UUqRmEK7s+yK5V8Q1ESnJ9GUJikAfi0/xt85kzKP/D8xyLKgXOuQ4wATMtbBRxH0925nPzKc+7f8zC754oQE3JuFX/pZfbGO8uqxeFNCrIow2X0Vop0kyP8/Xegyo+gh9m78gIG3WploJtWW+8oL4Pu8/3vUAk8Ny5ObvlUqwnNVlVs1KuXf2sEMlywWoIZ5ALIYO0qi4uC35c62kWBkxKfskBSmOBqRbXH47eW9vnu/vP3u9wv3P3nG2O+3JXipnlEGUg3Z8Mp3t3IPd35nYnZqZJeitF1u4zT+8/vVH+pnkSaFxQ+MFQr11/lJReYcW+i7t+J+W3c9gWc8+ThlwC93TpLgdHXz2AYeBUVDOfv/eKUtkuayoegOcXsuwGgLHnceYnbQrLB4N/LeOEwDbI0ouwcyZ9/bfT4cmG5SImCkv6vDGJfwF/A+hVwObirmic+k+URXd2Bn8+A3M5cLxdbXy4zV3VdpLRyZf81yru/URj4CzhdUp4Abvm3GlD53lx4+T8fwHFww9Lfkq91cUbSAyiH6lNxOI82xdnPLpull13HF9Bpn9qhaBkhyHC14sMCN+uACwAH/vjHP4L7zx9eir+An8H959tx98vNDPRLamJ8OE0Y73T9f/n1dx4w/qorn4E8vVa899yvG3ffpzy75Ruo36J3ZuBifDgh+EEwytn/UfD1am7i4pvT/PZc/NQclNXhO45eVpdNdkNS+RFYk+7k/cxAMQ7KPIxSusV5WY+iU2fZ1U1Qltgc7Mped4cBgRuKwmoFQXYKirsbpC9jwpdb9Msq9eUO/PzzrQm/IYiv5XyTXXAFBc63EcIXfKc5zsp++uNjyE8FyHGSMvyR7RT7RYpiXA5ev9DGXaWdRVye1/70Edanxwee/wZMjvuh8r8BAAD//wU1W8oaIAAA" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ part {
          ~ content      = <<-EOT
                #cloud-config
                
                users:
                  - name: ec2-user
                    ssh_authorized_keys:
                      - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                      - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
                
                write_files:
                  - path: /tmp/cloud_init_vars
                    content: |
                      OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                      COMPOSER_COMMIT=7f5e36dd948150fac4b03636c6d39bb76e2e81df
                      OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                      COMPOSER_HOST=aws.composer.osbuild.org
                      COMPOSER_ADDRESS=10.30.18.11
                      WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:brew_keys-7FUeel
                      SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                      SYSTEM_HOSTNAME_PREFIX=staging-internal-worker
                      COMPOSER_DIR=/etc/osbuild-composer
                      SECRETS_MANAGER_ENDPOINT_URL=https://vpce-0d13154306549b1cd-9zxr7z5v.secretsmanager.us-east-1.vpce.amazonaws.com/
                  - path: /etc/osbuild-composer/osbuild-composer.toml
                    content: |
                      [koji]
                      allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
                
                      [worker]
                      allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
                  - path: /etc/monitrc
                    content: |
                      # Monit configuration for Image Builder in AWS.
                      # Docs: https://mmonit.com/monit/documentation/monit.html
                
                      # Check every 30 seconds and log to syslog.
                      set daemon 30
                      set log syslog
                
                      # Allow access via ssh tunnel to see the monit console.
                      set httpd port 2812 and
                          use address localhost
                          allow admin:monit
                
                      # Verify that we're not eating all the memory on the instance.
                      CHECK SYSTEM $HOST
                        if memory usage > 75%
                          for 5 cycles
                          then exec /usr/local/bin/pozorbot_alert
                
                      # Ensure the root filesystem isn't full.
                      CHECK FILESYSTEM root PATH /
                        if space usage > 80%
                          for 5 times
                          within 15 cycles
                          then exec /usr/local/bin/pozorbot_alert
                
                      # Check to see if we can reach cdn.redhat.com.
                      # NOTE(mhayden): We will always get a 403 here because of client certs.
                      CHECK HOST rhel_cdn WITH ADDRESS cdn.redhat.com
                        if failed
                          ping
                          then exec /usr/local/bin/pozorbot_alert
                        if failed
                          port 443
                          protocol https
                          status = 403
                          with ssl options { CACERTIFICATEFILE: /etc/rhsm/ca/redhat-uep.pem }
                          then exec /usr/local/bin/pozorbot_alert
                  - path: /usr/local/bin/pozorbot_alert
                    content: |
                      #!/bin/bash
                      # Send alerts to pozorbot.
                      # Monit's environment variables are documented here:
                      # https://mmonit.com/monit/documentation/monit.html#ENVIRONMENT
                
                      QUEUE_URL=https://queue.amazonaws.com/933752197999/image-builder-pozorbot-staging
                      MESSAGE="🚨 $MONIT_EVENT for $MONIT_SERVICE on $MONIT_HOST at $MONIT_DATE"
                      RESULT=$(aws sqs send-message --queue-url $QUEUE_URL --message-body "$MESSAGE")
                      echo $RESULT
                
                runcmd:
                  - chmod +x /usr/local/bin/pozorbot_alert
                  - chmod 0700 /etc/monitrc
                  - systemctl enable --now monit
            EOT -> (known after apply)
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
    }

  # data.template_file.external_workers_cloud_config will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "external_workers_cloud_config"  {
      ~ id       = "9b091824090c20fc96ae8f1cdbb77093f716f5a306c8136a6a5b7c11dc0417c6" -> (known after apply)
      ~ rendered = <<-EOT
            #cloud-config
            
            users:
              - name: ec2-user
                ssh_authorized_keys:
                  - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                  - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
            
            write_files:
              - path: /tmp/cloud_init_vars
                content: |
                  OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                  COMPOSER_COMMIT=7f5e36dd948150fac4b03636c6d39bb76e2e81df
                  OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                  COMPOSER_HOST=aws.composer.osbuild.org
                  COMPOSER_ADDRESS=172.31.64.11
                  WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:brew_keys-7FUeel
                  SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                  SYSTEM_HOSTNAME_PREFIX=staging-external-worker
                  COMPOSER_DIR=/etc/osbuild-composer
                  SECRETS_MANAGER_ENDPOINT_URL=https://secretsmanager.us-east-1.amazonaws.com/
              - path: /etc/osbuild-composer/osbuild-composer.toml
                content: |
                  [koji]
                  allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
            
                  [worker]
                  allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
              - path: /etc/monitrc
                content: |
                  # Monit configuration for Image Builder in AWS.
                  # Docs: https://mmonit.com/monit/documentation/monit.html
            
                  # Check every 30 seconds and log to syslog.
                  set daemon 30
                  set log syslog
            
                  # Allow access via ssh tunnel to see the monit console.
                  set httpd port 2812 and
                      use address localhost
                      allow admin:monit
            
                  # Verify that we're not eating all the memory on the instance.
                  CHECK SYSTEM $HOST
                    if memory usage > 75%
                      for 5 cycles
                      then exec /usr/local/bin/pozorbot_alert
            
                  # Ensure the root filesystem isn't full.
                  CHECK FILESYSTEM root PATH /
                    if space usage > 80%
                      for 5 times
                      within 15 cycles
                      then exec /usr/local/bin/pozorbot_alert
            
                  # Check to see if we can reach cdn.redhat.com.
                  # NOTE(mhayden): We will always get a 403 here because of client certs.
                  CHECK HOST rhel_cdn WITH ADDRESS cdn.redhat.com
                    if failed
                      ping
                      then exec /usr/local/bin/pozorbot_alert
                    if failed
                      port 443
                      protocol https
                      status = 403
                      with ssl options { CACERTIFICATEFILE: /etc/rhsm/ca/redhat-uep.pem }
                      then exec /usr/local/bin/pozorbot_alert
              - path: /usr/local/bin/pozorbot_alert
                content: |
                  #!/bin/bash
                  # Send alerts to pozorbot.
                  # Monit's environment variables are documented here:
                  # https://mmonit.com/monit/documentation/monit.html#ENVIRONMENT
            
                  QUEUE_URL=https://queue.amazonaws.com/933752197999/image-builder-pozorbot-staging
                  MESSAGE="🚨 $MONIT_EVENT for $MONIT_SERVICE on $MONIT_HOST at $MONIT_DATE"
                  RESULT=$(aws sqs send-message --queue-url $QUEUE_URL --message-body "$MESSAGE")
                  echo $RESULT
            
            runcmd:
              - chmod +x /usr/local/bin/pozorbot_alert
              - chmod 0700 /etc/monitrc
              - systemctl enable --now monit
        EOT -> (known after apply)
      ~ vars     = {
          ~ "composer_address"                = "172.31.64.11" -> (known after apply)
            # (8 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # data.template_file.internal_workers_cloud_config will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "internal_workers_cloud_config"  {
      ~ id       = "fc45d9aa76a0e88e3903faeba31d14762a369c9244c2980270bed571b4132fce" -> (known after apply)
      ~ rendered = <<-EOT
            #cloud-config
            
            users:
              - name: ec2-user
                ssh_authorized_keys:
                  - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                  - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
            
            write_files:
              - path: /tmp/cloud_init_vars
                content: |
                  OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                  COMPOSER_COMMIT=7f5e36dd948150fac4b03636c6d39bb76e2e81df
                  OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                  COMPOSER_HOST=aws.composer.osbuild.org
                  COMPOSER_ADDRESS=10.30.18.11
                  WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:brew_keys-7FUeel
                  SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                  SYSTEM_HOSTNAME_PREFIX=staging-internal-worker
                  COMPOSER_DIR=/etc/osbuild-composer
                  SECRETS_MANAGER_ENDPOINT_URL=https://vpce-0d13154306549b1cd-9zxr7z5v.secretsmanager.us-east-1.vpce.amazonaws.com/
              - path: /etc/osbuild-composer/osbuild-composer.toml
                content: |
                  [koji]
                  allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
            
                  [worker]
                  allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
              - path: /etc/monitrc
                content: |
                  # Monit configuration for Image Builder in AWS.
                  # Docs: https://mmonit.com/monit/documentation/monit.html
            
                  # Check every 30 seconds and log to syslog.
                  set daemon 30
                  set log syslog
            
                  # Allow access via ssh tunnel to see the monit console.
                  set httpd port 2812 and
                      use address localhost
                      allow admin:monit
            
                  # Verify that we're not eating all the memory on the instance.
                  CHECK SYSTEM $HOST
                    if memory usage > 75%
                      for 5 cycles
                      then exec /usr/local/bin/pozorbot_alert
            
                  # Ensure the root filesystem isn't full.
                  CHECK FILESYSTEM root PATH /
                    if space usage > 80%
                      for 5 times
                      within 15 cycles
                      then exec /usr/local/bin/pozorbot_alert
            
                  # Check to see if we can reach cdn.redhat.com.
                  # NOTE(mhayden): We will always get a 403 here because of client certs.
                  CHECK HOST rhel_cdn WITH ADDRESS cdn.redhat.com
                    if failed
                      ping
                      then exec /usr/local/bin/pozorbot_alert
                    if failed
                      port 443
                      protocol https
                      status = 403
                      with ssl options { CACERTIFICATEFILE: /etc/rhsm/ca/redhat-uep.pem }
                      then exec /usr/local/bin/pozorbot_alert
              - path: /usr/local/bin/pozorbot_alert
                content: |
                  #!/bin/bash
                  # Send alerts to pozorbot.
                  # Monit's environment variables are documented here:
                  # https://mmonit.com/monit/documentation/monit.html#ENVIRONMENT
            
                  QUEUE_URL=https://queue.amazonaws.com/933752197999/image-builder-pozorbot-staging
                  MESSAGE="🚨 $MONIT_EVENT for $MONIT_SERVICE on $MONIT_HOST at $MONIT_DATE"
                  RESULT=$(aws sqs send-message --queue-url $QUEUE_URL --message-body "$MESSAGE")
                  echo $RESULT
            
            runcmd:
              - chmod +x /usr/local/bin/pozorbot_alert
              - chmod 0700 /etc/monitrc
              - systemctl enable --now monit
        EOT -> (known after apply)
      ~ vars     = {
          ~ "composer_address"                = "10.30.18.11" -> (known after apply)
            # (8 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # aws_instance.composer_external must be replaced
-/+ resource "aws_instance" "composer_external" {
      ~ arn                          = "arn:aws:ec2:us-east-1:933752197999:instance/i-0351a00a6c8e78e4f" -> (known after apply)
      ~ associate_public_ip_address  = true -> (known after apply)
      ~ availability_zone            = "us-east-1f" -> (known after apply)
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 2 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
      - hibernation                  = false -> null
      + host_id                      = (known after apply)
      ~ id                           = "i-0351a00a6c8e78e4f" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
      + key_name                     = (known after apply)
      - monitoring                   = false -> null
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-02f250427cdd85dc7" -> (known after apply)
      ~ private_dns                  = "ip-172-31-64-11.ec2.internal" -> (known after apply)
      ~ private_ip                   = "172.31.64.11" -> (known after apply)
      ~ public_dns                   = "ec2-34-234-177-181.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                    = "34.234.177.181" -> (known after apply)
      ~ secondary_private_ips        = [] -> (known after apply)
      ~ security_groups              = [
          - "external_composer_staging",
        ] -> (known after apply)
      - source_dest_check            = true -> null
      ~ subnet_id                    = "subnet-0c016a02" -> (known after apply)
        tags                         = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🏗 External Composer (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ tenancy                      = "default" -> (known after apply)
      ~ user_data_base64             = "H4sIAAAAAAAA/9R72W7jSprmvYF6B3aeHFQ3TsvmIilTWZWNFkVSi80Ic4mgyJ6GwSUsLsElSWohT50XmZu5ncebRxgEJfvYzuVUFRqYagOCzVj++Jfv30L0oixaUrQju6vIJy7f0zap/Lq9yZMTif7EBeW+iPy6+/xOX+uqDBFQ5qb77oo9jTCpm6QsPnHCNf+Hqz9cjUYvF/3h6om2kjRV2STtsNZvWz+Mc1K0f+IeE0oKPyef3yVF0l6Hj7t3v+2ya79oHkk9UouwjJJi94n7ECTtiwUDyy05tTchLffRKCyLx2T3hys9yclXzP30cs3V1b4hdfPpiuNGHOPgE0dCccQGrziO45omfvD3bVzWSU+ih4x0w1r2M+LeNU08qhufm8/nc1kCvb8QulBU2aMyN+byfD5fzI3FKX3U1mu6fFwUsySkqy53alWubSTSu2mbWUtbINWHaHHfH4XUnTpFbND7rV6R+zoBJ7Cly4+hA2c3plbJEd/PtCPofs4ed/Hscd8Bdzxb/6z7U9jZWN5NYlBqp0dzu5wkqza8sQxaBKqW3FZWNqZJVY4Nr5XbfDf/ssus+VTp424XTPcTfZac7PVp7Mjp3tL55dboQVqRxy5x9j83a/PnWES1kd3O5f1+7RpBndKftRjn/t2hPnQ2FPcNbA+FK6dxcH/s4AfRuU/96ja6mcW2/+VeFY5aN0WaWGzD8f3uyO8SI5g2SaDZ/Qdgk5MjTYzZxy+VAR3dvQ2rnVdTy1+tbj1Lj9seftAjr4Z3GtqWljAn8268i9sQ1FC2aTCxDvcfpL7nv8imJoYLOIb8sZocj1/u48NRLNpAquy7+zYi7eZnPOGN+6Iqtp1lFV4l9toxJKIQbE/TD0U8o0V8V3u7lHwIS6O4n2unm5BKU9XadLtkfx/Kx58z4aO7p66+RV98uc2Om7vMTJUqtbcimegbYVoqH5rNKhzfOJOse7w7RHqD4+iLsNiulhjDqi93AT+bYDfhza1WFZ55IxC8W9yYPzu4a91H9yNfP2IYRvNSXHqPxWbSuybabjYz3cv84nSS1A8IJpm6AbMGpSLP99NF1/Hrx/UXO9gI8uTxw2Mk+aFZ342V0EWRtr4R5A44U01IP4ReMl/CzS0I+q3G21L7+PHEE8H4/JnL/bSs/70mUey312GZv3uNdxKJk4kwGzC/OGOeespaALY6YWPre1lINTquppotJ6eVPT3CbLr9WKQ33gdS3gNDvdH54+344+SWK4N95CevDrs61klLHlhEuLhl5bfxJ+6mzauzez+wGPFw8Otm4Cw8R4FP3F8ujEJLRus75WEBdX1tf/4ohf7jR54nE3EijoOxMH788DgJHic+4SMpnAli+HEmzMTL7gXU76Glmk/bPzxOiDSNotn4ozDhH/1wHPDSVJqG00iaBcGHKRHJRyF6fHv4/GGhmvbnO4tv7yxhYaJoYyeyYuINspC3MXgNmcMc3y4yYWMhU8UqUAzH23q8JlloI3s8xUgBhi66PcDyEmUTIRA9nuT6xFYy0VzGKBBNOeJN00HVXSBUG3/lpXammSY63hpUkyPe+2JiDIyMrgxbwybSpIg/JTo/qTwtakKhUsDWSwMHSNYyTu1M+GJso3us4qmNTY8gQcU22PpLAO1tJUfHis2NX81l2tbGGzPiceEg00FYU01V46Nc76xUi7EU1/aSnxBcTQ0eyIinkqlpnpW1ByejZZQDuBh43iwQ0lRPjDSkauqw1pkp7NnINGAUcu1gzbUw0N0+vnOcCiBMC1LIJkRA1oXNnZ5Ha1ORT+5W66N0d+viTYozXQRUn3hZfDIROvnohB31o6QrG5OkuPfFqtSl6mSv6AqlsYSoe7gTwUZ31qcwlTHBle3yJ18XQgnjqjOOJQ8UM3elsre3dBxoYIoF7CFBLoyM3vnLSIYrrQ1pZenOLHcdsyMrbNmLtg8yT7WcdqxLYe322q2H8V7PQaNrUbWgmHeUzcoUPMWkEbBF7eBlZu1oWDELfGetolvkREt7ZfaWCnzHAXlEI8fSKh9k43HER0edar5jryduHwvBVv6i4/ktUr3GUfWxt9R8WxViR6OJacvA2pqOroK1VciSydOjW9B9gCkKFm1vFlgMFPOAl0JHVuWBbONpqJoizoT7MNM2gVGNA7GRQopbvMKZucQaEjYLW4xkHbWCiwQLr3BsbWUz6DdZIHmn235+MnO3N9C4wwjIEY9lw9EgVoWluY3WCFN1QT1LV2cLg1LNzErJsz1Xl7Kjt5w1oTW7dalXuRmtItHcI2Feg0xYQDWSdYwzaxuZDhIWLtKWVhpRQHc9seUsEI+339krP+01t5FmJDMJIQ8YSFgYjjv+tl+dnjFq7CrZLCoRiJRafDgJtOouzNad7Qi+r2onS6U6cU6xLVEntEPJ7OnCxhtkFuDoFIjXV2vJFEzJ5c0yyneCicDB0rRkkZ/qyJZdgGaux5uiswKLcDlbWquNqKvtveWcbCDgW33rHsGyOViUFs4qrINlhfBKP8BtdQzS2ML5qQ1X6GDywr1to1vkbFZo0UI/xX7Y49zkva2vjiXbXgvIaTFUNrfBKqZWpjVoG68N8aSgJR6jDADX1iZgO5fwclJARb6zaMQTLBvQqHgkRsAo5hLA2PKcjzxAaIzUqrOKee+v6AFomzHEG9MU2444wLK2UW5ksehLMbBybx+KuuRYMxE4VDDTuCWqMF2kgHezcnLLVxMTaYK1Kk9uFgkhAu6tpN0ibKJoMTOD3u2iLNq6KJsgwbtzqT52cawb/QaCQkt9Z3MKUzT2UlO1MuPWKkBjWx+lcAUmYaodwNbk3WyzBzQTjK0+WyTnmGyiibpWgYaouTEzqhjY1M6xnL/9KlOwQG+IuIuWNPcdEEdLNF0k8916Iavu1ozhrtytF/PzR/NoWIAqEMfTtaLvbhV5rCfZ7fP8Qra97aZynePOLnDr5rh7tf/8EXWlHEO7HLt9edT7igK7ykFfZaAveahUmduXJ70vBU8pe9cuj25aTsDwXGWeXcWeXZ5AWp6gXSXgFX+g8sRJHK1w51myHCyjQ5hT3l/y0/UKlK69FgCNqmgZW4jXtCAHHdnKvO/M9meZzx9rC/rIwR1MZMVOhUMobgTfOWV3+azzjq/0EQdLmvlbc/Jy//BRJ4doIS88xzuEOZqu1SoOkvlJZx+l7IBddnAx73RlfVqrEcDzt3qSYSAZO8PxeG+73sFEvnWd8U635+wz1VM01dPdTk/nvW7JKxsbr+wQOZsvngN4mMg0cLQqULXMW21oKOmzQAJJ5NDGW+Iu5OXOc8zS3Rp7V5y1L+VAEk78HKfRQjYiZ9P4jr6zRDxZq3Tv5R+nX8msyYKbnyq3k++8bbYznFMRSBum7xYmcheK39f5C94txKs7tMJJsKTpHWopscvdrbI+AmW3c3PK3xpfYWr42M4si5yTEPbl7bfmL5+jrlQ5SKvMU6qU2QLaVQxslhjLCVRKQU9LHqQlayIotKtUT0tms15Pf0RXpiBldMvJYN+05D2lyj27lHS77N2+FN20SoBd9gzzns3ol4JrV6ln/5Dficf4GuhUiWuXnduXEvMVPS1Ftl9XyhPj+0KL+dZx4PvHdDtPKUXQl5KuVCmj6zEd9FXCxoBS5S7TC5MjrXJdKXk3LUXdLoUf05Vz1x74ET1l8FOmiw6yM9KyZ/x5g34Yf1XC+HTtwc95T/khv4wWr9tVrvcsuVa5nlYZ45ONAaXs3JTFBhYjyolrV5TZmcWT37Fb7PaMRtlDm/Fc5W4/xCYRKIN+qZuWY70f5JBc+2xTLx30/CN++SE+9QxPFdX78uQx+5wxd2R8e2kpwLNeO90eYoLg2eUR/Bi/EsOm2w9yHaHCaFe5mw44O11oTHSb2baKGW4YzjyG5x/SlamulOLFF8aeUsVAqSjoy7F31s3ESxn+Kur2Ay1RZ3hOmVw/1sM5hleU8c30yOztnf2L8TcGlzgPlFIAaTlmMoB00P+P6A6Y0QddlCemDy+tYn04Z7Ahz2R3GWbYOFtrl0fmS79Dd9AX0ydUGD4H+ST97INHZh+olGOGZX2YG/DQA6WK3R/bjfds5qNlp6fMFwZsjKHCnoezBl1DhmtmU6YX5ndpefodu+VwwCmLXVXi9gz3Zc9iEMPxgLsBG2cfH3yG4Y35xY/9OAFnv+8GXpSz/UBaHnW7ivUhtlUZ80U3HXL2kfmHrvxefJj3UBli5Jj5gcvilXKuAaDC7Djg+DjgzS4FeM7/LEbF3g/9eM7iXwKO384N5jY+BuKEBoUxXSuuAGxdWi92R6KoR12Zn17lFG0n6AoV9U6mZGXSYKh5Jv3XtYzsAns+iVJ9Z+Raz/KjIc72oWR2rkP30Uqfrpeg87dm5Ypa8518pxh2tTTQyTa/ymu/0X+Ri4fcajmML7PyckrDtNx9m/ZcBEolm0M8rpamXammXS10u1IZ5kyl0ljeYOOGXS3gOTctGH4A48kuRTOtNDOtZN2uFPNH8m8x7y9nTNbJWm0pseSNt8T7c13Jaqn5t223bClxaAZTqsHM1GCGJjCNVJi5HcyME8xMGaZrAWbaYhhL8QKmSITpWoSZPoZpvIDpXIKpK8HUGMPMW8JsI39H16q/3UDXEShMZj+u7V58QhF3vqM1MAVLmIY9zNhZ0RKmkQZTcwlTVYCp2sPU02CmnmDmLYZ1w1qjg5mnwgyNYcr4Rf15jXFc/ECfQ52l4d51IgoTOR3qWAfEwVd14gXfS1r4WzMOFrLtO9He3ZpCmKPmYgtWd1XhMqZhLjAf+MoWjoKOcOv2axWPoyXee0ucXfbiUNQKz/4exmRka/oOizhZa4CGhUfDRJajrVl6zoQ/9xT0EPxA1hfYloOVScN8wvaIniVfbPUd7KgmRH2VBqJwDCRAw2Ty2p7dcWeqExsWgGd6vMvBIdjKB2bPu3zWuwWugqWxD6RNcbeQVZvqU3cb9T9ad+mNXur4bZ3b+0u1A7a39bdmiSiQTWeShgU9fq0HOYaDr5UTnfVC6ZDH0qG2OddwLEewPHh6qiNZ3GX1AsvTQ91jDzXlK/24oj6Fy/XUS9Up6OdTIKKpZ8+nnqNOvRxNwXI91e1sqqfZ1FPUqWujqae4UzdXp7qym3pLNIW28bq+X2IK0x3DbwfzTQxzL4WpnMN0N4HpnPllBtPseF6Dc5hvMpi6Y5jjGOaogylbH77pB2WWgyYsdwy9HqsPWd5iMimsVhpqmSF/szoRnGuHicfyhVJ2HqtH06G+eSU/dPSplxpTYOtTtzemrr0bdKHn7tRz0FTvmZxo6opoCtmzrU6hgqa6Ek7dPhzGvHT+Wn5lzsM0zmCu8zDXcpgbPExVEebGGKbrHqZyBnPEw9w9wXQ9hmkownTXw1TlYeqKw77UOL3JIRNWe3rK0Pey+qEf+l97eGZ1J8vpKRhydhWf83cpst7YTcujx3qNvkrgm3pGt9EUpO4U2voUMD0MMjK5mN2NKejXU1dkMq+nwA6nQGFY2U1d2526g96Y/O4b+2spzLUEpu5kiGFpNoHpJoc5OsJcPcLU5WG6ZrL2MN0JMFc7mKITTM0cpvPxMJ+rwlv7A6VK9HOdehpqZfacstw/6EHSz3cBvH7xAVbjMX0NuFCGupLVNa/xb4dTvZ9PdSafiKa6Y0x1hu0l65nDqZu6Uy9XBz3ozFcUY8A76BlusinIGUbWb+y/E2EapTDVEpibFKYhD1ONwlzvYaofYQoSmLviOQ+EHUzXHUwZZtYCTOUUppQOe1/bn/UxzI9TvR/qIWHAgz34/Bj0VXbpR4WhP2U+wOTuq2So74cxVrO/lp/5uJe7U7A0pp5iTIGiD7LpzA9yNHXT9VTP2bg62J7FC0+ZD/gA9nrq2d/yfxDDNJycMT0/Pl02GRleWWi8M3hsYZUuLQRkrKJh7s6ogIWoSpxKMXits8RIjni6MJxogzHdBEiQb4Vdr9vyF5dHJ13xFOCYmS6pPOajxNlGKsL01hJnvuXEostPZISwvsg2prGNln6GsY02G5NXTxhhOZIi3U0B9B1zG6yAb/RYdEUhjfi4dPkJ8DMs2djUCBKQsaUQqxmPxeGLg6m5DW/ZXMS/nKvkAAk22kYbT3jDh9MuzDx2Xn5R4ND4llBtbeUn3xTj0lN1wd8xPMuSJ0aajwRZVyMFSdoK8TTRedM00UZGGMuGbW6MzJSMbVR4PL4znNnGyDTTVNa9y2vHUMO2g3Ht2GvR5am5yATBTTe1IVTwTpxocKlKeFtKPq1iUsw7JwdJIIFMV6tTxG9Kd1sdfL6SUK/tXV44RHgtecq8DnFlQBXzvobzQMhuXbrxAtSCsGu/IHGziBxwANS0nGw91vtoomN5rauNCETcRsjg9ZU2Jepsq/fxF1PYnEBqgsDBIrBmFXb4Hm8x8Ixq6vKadtdrpa1SG+d4oQvZWF9GX/yk6U3suaHq7UMc+142ro1CPjr2pga2wQNnLIUFgHrWdNayPdgK/mJvNYPk2nGRx2rAYycQvK2TmUdDkBck9w6Rsx4jIeYNcYZNNGksrUo8dKo9B9z6/EyxtmBsrVxeX2004GibUEK9j8AtUBAfFOEt0GhCkHvwV1prr6rCRmBiqrveUttNpNFCX26SiKceXgrQ46PiTjIh6IHsFBHGS2p6vHaybJx7IkiRI1AsaHx0rDp9q/aGEwEj02RTrAovjSVP9KSIN+Xhy6dURgbW1nf8Rra2kWyqWmbkEcRZbAIVLz1Bw07W8I4140GxOwYpOCxozIc2BoBXT7cif4jyWQpXEUaYqpiuj3620QIpsi2k4aAwpHDp5ba27nwcdXB54jFf9T46LfTc3Nz10clXoxPC2a2NNh5RPdXAYOHxE8fINGAjvYPbyguod3SzyIycdW/lk8LX1IPbzbI70auh5ml66pW3PYAklUVdnN2b2azUVVO2j9VAy9LUsZFpOVTxwkCCYuSaHPFYuuigMTJNinhQOIjeRQJdGFTDlqpJ5jZynuRC2UYDqwhZiOIFzTq4NVOzp1OHxhvGl53TDIun3sl0IcpB6yGwCrLx0cFRFqin1i68xFE3ottvHIJO7ddyjW89MS79pdHbW+zpKeVdPpwQWrnWFn/zS8i3XwwaWNNsdWMayGQ+vTBQW+hGVUc8TUnhaVZhdMjBKVYNyRK1tb41U4KOY0dd10CddbcCGPvS/OjieBs50RfPOd2DjOKwWI9NxawNIfYNnrqg1w6L1BOsAqSRGqWmZvYQtR1WJ67Pt0eyoidPwQp0aBauyiO2YzvoY/tOwgDh+D7I45WZrceeg8YGBpCozQEjj/fE8tZcYkTUdu0ic2mKGw3hagoxuIt6o/PFqguQkGBJq6y82kZdiyK0cQKn6VCOl2ALsCuBkyG4R1sxjyHdOHCrTcJdFeNs5tuLVvGESkF5VbqosvAqKn1JzpBUnVBumqE0l1wHjO1MWwdJy+NlK9srenKlSA5SM7PEkA8KUwxX1LAwwItcPwQrDAKhHJt9Juhq3Nvb6P5OoMgV6cZElUkcvNJ7r4x6c+F2sxbxu87MKgflwDFXYIszL/bS8ICXpmUuwdhPmttQzE4G1XpCtVZHpyZQhSNwIsmw+dvLl+SanRnfyYHl57dfuljW3cOt6loPcxN89uvik39sPjUkrEnb5H7h70j9ad+MiN+0I+HTTJI+TERh9mE2m11WfSKnltSFTx/CMq/KhtTD6z2j3UTld/blOAvJ1sJc39trCB70OZgvL28GzIHy95/c7IMmrJOqTcpidNkyCss894tolBkuLWdP57uWreoPK2jZYK6rD/emqq23n5vW3yXFbvQkwuhJhLdaUtbm5xvShjdlE+wTGr1daKkLU7WtZ9FUoNzDNbAfkHn3OW7bqvl0c/Natutn2a793O/Lwj8212GZ3zydfQeR4sztxerhDi6tb5Ok5a75EaHntz6+xftXA9dtmdNvvwzyH1mZJv95efApLY8keojK3E+KhvvM/Qf3riV+fn2heF3Wu3f/yr2L98F1UJPj2/FjWWek/nqKezoh9LnP3Ltvcx36o7BuryuSv7t64u5M8G/m77+Mjzeazssiaevw26r8idPZNHd+c25f+wy+3GNZc+vc3xFOZseQmksKbu5Y18+7lDJsPnFPls+HMwY7D3/dRGW4z0nRDuTOY9dxm9OrZwKLmIQZRw6k7jiJ5xoSlkXUcH4RcbTccW3JNV1Dy93TkQ1pucgneVlwEv9ijC0+r/yN9pypnPPDkDQNd0h8rmlirt0XBaEDYUK4NiZc/iR5U1Ly8hwmVsRVZd1y4kdBZExdZtnPviGcH0U1I07L0Kdx2bQv5v3z6VGeFJ+GI35jDJM6eey4NvZb7kj+WBOuKFuO+G1S7Ni+M1skL+uOK4vhKSma1i/CZ/4WK3Vxewkh3HsWQ56PTh6f9u4bZrt/4z5M/scLxphVJ1zYhZQ0L4bbmBQcOZGQu9k39c0g0k2QFDdV2Zd1ULYPPiX1CynUotnXZxXWZdkOL3o2XdOSnEua4o8t97in9DW/2vpOvfA8bLmf2yvu5iXnTeWH5Jnxj/zXjLdJ/orvY9LGScEJ/8UivXWtv1G857xTkbpJGuZtF2kPfn1Dk+B7UfsfQAtnn7x4SPLIHQkX+gVXEz+MuTAqrn97p++3SACgrf5zHvtdRIp/+cQ5hDsmlHI+Pfpdw+1Iy/ncmJe4mNSEC0joM/8pH7mQJkw3Ianb5rU2Gai5Oib0IYwKzlnbK26uKKZqWW+YeKm5Rz+h5KWbVkmx+zuU8UOSLCKMx9LLobpsy7Ck51D4YqJp/XbPov2Yl96Yi2saypVDodBwv3CL+UI17bW2XsxtlSHpErfruMlvQv/mLO9oTyoW3rlf/y6hnjPC7wr/dYr4p2Fp4Dfxs9EtUkTcsKdheHkic/06q/yx4UhxSOqyYLmAO/h14geUNJxfE+4pRZBogMan561/c1L5SQV4bUKgq8B+ArOBVKS+qk6+7MmevClKXtZxNwlLeKPgnPBGTyKNLmXZha6uWtZ8qX5+93//9//6P9x7HYK1/aBiFdiDf14GLNXE64XKYvhlZMC03z49KnNbfXoH11QtdGd/fv/P/rHhmi8N15AiGuWkGaLAaDQwPtrXlHv/LBU3elowCsqo4969vzD27l8uVEkYl9z7M+2rq3pfhHl0fvU2jPMy4n4+/RWYOS/lP/D821JixJ1DYthSjhTMqtxoVJTHc1L9wb8L/C0v/p9GTUwoPZfV33vz/wU6We4ekX3JVUlFmPdeNeW+Dsm33zO++olbkvZVkuXWyvXVGlj2HCzUh7Xy+f0/h0zxo7tmgOWnmxthOrsWJ+Pry+8b6rekaW9y0vqjyG/9mydaoyT6F3bGvGlIzvTDyoTCz8n1lYbu7p7L/8/v3v/y7Y7g19H7X14w8+s7Ru6+ToqWK/dnxgtyfEF3sPk7i7RDPXHJWU/TzE/f//Lq6F+vB5LWRQtvNlxfPf3FjNyQdvRM6v0rMv89rH1RzrlLC5iCnq3elpy5AmdlmGTHsnb9GhdD2GZrrt44zeCzr1oplvJG56HRwad7wv1P5i8jUkRVmRTt2ZN/+VGT9utly4VKErH1v9O0/sr9hUu/cKOae3dtDfustk6K3Tvu384KedmfPlx4fbj0p9dpUxZXT9t/tPLdX0mM+ws3GKnOudHjX8vA1bd66Mv/FHGjkb9vy/9OWFNIRcuOIS0j3bm1YdVO8piELGic8XZe9LLy5Bbzl+uurwK/IdMxN4q4EffnP/+Ze//Lm39I+JX7N+79Ly/vB3590RC+OeW5rv2dM169CfvNEy6Efu+cjHT//9zmm1dLv+srry6PXjvHy6l331t9Rv+zQn+gO6YcprsXfvKNw/9RQH+lytaDZUOTlUA3ETncFIecCIVwZdlzWz3fTH23z3mTn/bVbxhp2rL2d+S3fLSvnsZYEfV8J3SVPHL/xO1qUjEsPJ35K3dT1SUrT/ZF2/xpKIuvXrR1qmxxSTP0bR2rbwsSsrLzMamboWRllZu91lWTSwruF/76WuL5X//EReXVU1vWstLthfDPZ7CfoCZ+Nvz9mJz/wZASUnHCFcdFZUGurn7rrZJHbqtZr1tKzqc18aOOy/1oaPMHGU+PzUNSPJbfOzbPHpvr02Pzav5qYGE4T/ezb/SyTBDCRUlNwrasu+HKIGmapBjuWfIsSmpu9Fq3Z3LzKGJpcqgCH5vWD4ZwNiic7Txb9v0vL3j59bWFGKsRefT3tG04nuPfcX/hWkK4kf+CKOOBkXwt1MCASRgcLfUuKfanc5NyOjeONWFIIWFZcCPz8Nxnn7cxLL3QdkXqQd6yGLaGcXlku7iHt5r69NXIN5Ty8jpnKKAuiE0a7lgnLauKrziuLfdh/Gr3zXVVl4eEsZEUu4eQQYMJMsSA3134mPzDxIO/puD6lreT+pCETxlwHqX7pv1tti05OlycMM/3uaIsWA9WRH59uZMb9J00HB1u4JKM0I5tCsjVT1wT+kVBogGdVV0GJLq++omzoQJf31EUhC063xAyANVJeO7HL9duBWmPZZ1xlBwIZY1bU+aM/pCL/pUL9i13ZD1s8ceWi/0D4ZKWq5Nd3HJFeby+evakAdtn8EWX318FxpFfJddNGWakvY5urphX/O3bygOp6yQi12FZPLI8NkTnPaXcn//MqVC7+g9rWPqfV3eDcq22Jn7++fXT7OOH6RVb/Ftzd75zHdWEln50bkBIxfr3t+z8kSkyL1vCnS+yn6082OLMZ3P9gnLuN9kzlfOefxeuL7uuvtNePq0/H3XZdtHC7+35huK+8qTR6A9X/y8AAP//QRSLxzY/AAA=" -> "H4sIAAAAAAAA/9Q56XLjuJn/VTXvgHh6a5LqUCJ12fKMU9FB6rBIWTwlZVMqkIBEiiBIE6Cunn6R/bN/9/H2EbZISW7Z7Z4jlapN/Mcm8N34bndjyjHlgnlI8D2IMsKDBKa8EgV7jH4EbpxRBNPDw406VOXOxNJ6bX1+U8q/BBunLIjpPZDK4nel70qCcA30XelCuxewJGYBL2Ah59DzI0z5j2AVEExhhB9uAhrwsrda33zBMlNI2Qqngky9GAV0fQ9u3YBfARQic7znFY/EGRK8mK6C9XclNYjwV8J9fw1TKmUMp+y+BIAAcgnuAfaqQn5YAgAAxvwlzLgfp8ERo2WIDwVs/iOAG8Z8IWUQtNvtdqemHWFXOnhVOf/staftTrvd7ran3f1mpQyHpL/q0lbgkcEhclK5k5pWlYybPDT6poSTW9R9Ou6kzbzpUH9KnmZqgp/SQNtrM9K/85xJq6IrSQeJx5ay0w4fw9Xab62ygzavt4YfVdicHEy7s274WqzsV/qs3wgG3KsYU0JdWQkeEyOskyCJ69MF7/Bo3X5eh0a72Tv6h7XbzBpqK9ibw33d6WwyQxX7s+lR2yR4dQic7CMb6h/9qpVOw8d2J8uG86mbbshHxbcjON6m24M5qWZswrd03tn47tPuMLmtOk8bmDyiSss34fOTLO2UQ9NSqnTm1Z/WO3EdTN0mC1zFPN5qJt47tca0dfecTCeOOn/0kvUiJQYcDB4Xhurz4+RWRYt0MlasWWxIbdw+1Nc+97R00jGJ2zC2T7e141F87uhK1etO6hNxlzR2u+cnf7urUu7WEnP8xBHmo492Q5w+0YTODoZBF0n1qOw8XJXc2b55S/0Wof44Xaw3+NaLp/SprewrHqk1ZWN0WAfZk9fZfQylu3lG5urMeoYdHu5G41Df9JKNOavihjqSmnHvlo0GXr3iNMLDarxFKrN99Cx1Z4O+bU+SY7x2xVbDngeiPlMSutArErbX3Yr+0bEPfL6a34npyp54qB1X+4sVHTWOc92ajUYtdRFCut/X5FtrEoTySGsxa1MVxWOzeziIw9Xw2XRHUqexul2hGvT0dFzveXMLKcOK1DloTlORNrfeImj3J6NHzT3OFNGs8dXdXsTS9OEBRHATp39NMfIhL3txdPPa3zGqNhpSq/D57snnyaI3lDRTbuRnw6eOtFFIPWkqZifYD8zmbhI2Z3d0U1nc4vhJm8oVVdw91u8ajyB2MwSDV8xKuzTgeJlnhHNYJpD796DCo+QU3ss8Ryy3MGWFZN4pC9yDn8+CToyONRz3lt2Jqg7Nh7uaB1d3oogb1Ua17tal+up21XBXDYhFVPNaUtW7a0mt6hm7O1GfJoasX9BvVw1cayLUqt9JDXEFvbor1pq1ptdEtZbr3jZxFd9JaPWWeXvZlXXzYWyIfGxIXd1CIzPo9HR7ZBnWYjQVFUsv7kTeDaWRYemyLWu9qbOYLUSlZlijzkIkttXTpmp1ftTsTt8KG5JbXYg4UhtmL6zqfd9yq3oHibruWMnYlZIRHCw2ZqjourV7nBKlg8TFs27b2jQkg6mp2Lql1JC4D1SxkSwUxDwp6WmzxcZ1tJrR9zdmKD1PZ+jJlu2maesLbEmybWoz2Ncm5izpoF2S39Vf3YXKzLRHOhJt6li6Y9mKrMuKiCL1YGwU3675qdkXG9hOmlNR61giqemKsjBCvnVCEqNIm3QLmUddy1LkRRUplqzIBazT6uXf01DRprSTOrYyN2xNnR/9seMkmmUTimlHn1haR5VGYzVCQ73X2c9nyhFt1o9ze7SxQ7WqEbWxCP29bll7aO1tR76rqb2Rjjf2EVaTWK0le3NABtbGr1lkvh1XtZHqDPfepmNjOzHn4h6qklez7eQw3cWi1tOjeS0+mjNSdxWtaUv2wpI6dBqSMeyjzmSgcI8khuq0ormjH/DANswuP7rhQjYcXldrXjo/Ko8L287USGOqgpIusUWnNxro0qKnE6SZVWW7CPXUUeyeTu2xMUCPloP65kA/GrIGHUeLEEGOoSRQC+t1JKKdShTomMPG/OhL7qzzrNrtR0teMEdW64u+Ak1Z8h2FBLrZ0YyZ7qiyNjRop6aLZDenJHNtYrldftSpXXV7+tbuSwc8iLd45jc9Wa/aofTkhcrInSZ1t8pqHrG5PbBDvW8rljTqmlXUUS0uzS3JsAe2b8w6unschW5tsX88tvd6ND9OrfrBtrQOEu3O1FEmtiz19RkaWjaRu2RhqHKrOyVE0cO4tjAXc7UW7hb9FvOM1uOcLJJ5SBJU1TNLaqdaKHUnMuqoth0aM6Q7ltSdW0rf2CCikfURm53Qre4ev4HbueDqM6RMg1bNshba1JK6U2defz+u9i8+Ol0nHZ0mVa1KiCF6DVdJxl44PJiOBKGs7A2ZqNjZ+2aNOJ7p1fQj6Zr2yNKptnOoJaqDYU2X9Npc1GMUrSXd0raGogTdaJ8iszPXrNZ8IepVZ6B1vX6rbwxGVVXmT4azNzXJflRn853WZ1uDEOoMvNTtJ5Y9ULeTWbJzN75hR3vuDaytLkpPpmk9Ws5oYHX5BG5s6B3tSBcXMyjXa6Y5lCyH25Pe6NEd+MQIFWbN/OG0uu9ZfbtuhZo2N5WGNmvX7H6DTnqdsUGQiO3OdDJNRKuKtClt1zTbNhbOnahZVt2Sk4NB20c4IFtNGdUn9kjXq/yAHc0wZiiahn4V1nzNiBaZV1VrjtGqag6R9I3PsSw1uxtNnIdx41FMGrqlSMYg3s9DJHmWNn+sKY+WrVuo29Ld4/yAQjSbW2HDkhbjOVHrc9tXp8fRRKPKBjqjvbex6ouNLhvh9NGgGjONu5o30BreRtlqM12ch6NMI6E0namtbnDKybrVkIeyplhEH+kh6U1tXTnlcvHxbaUwjPHyUZ4by7auPcCU3sMdu2fYSzFnEaRwjdP7jAkYMi5I961a7bZRlVq3rVbrDHWP9xynFJKlF0dJzHBadJrCuiGLa/PMzrA6RlcfPpnDibZU21q7fy5Sba33j3Nmmcu8NEjynlw4owheHEWQIiGczkncuvCfG6asLgcTw9Taqrx80mVlOHtgHK4DuhYuKggXFd5aqTfUHyqYe5WYuVlA0FtAQ+7qsmm8qCZrvafJUDOXlj5+8DlP2H2l8lq38otuZRjBY0zhjuVdROXCezyxek7b7A6W40nfeJ8kidfslwi9NCDvyf7VQZnHEXm/L/lbGG+Cv58/ICHxDqMliiMYUAYewN/ADccwKp8pluN0ffNncONnbtlN8e7t+S5OQ5x+fQUuHDwIHsDN+1J7UPBSXk5w3nCdpTsR/N3y/dPkeGPpKKYBT733Tfk9UPNrcBrishTm7gtWcQqGEVxj0MnZ4BQEFLQdo/yC1Ys9dg8uLx8VPIp3Lv6qoNjL8oG0IHc6K/s8IqUXAl0feyHAW5weQE0EDHsxRQxAigCJ14DHgB0YidcXlgxzgCCOYgpq4tVZDnyC/EK7nZscQM/DjIFtAPPhE/CMUkwKwhgD7mMQXTRnMcHXfHK1EEjilIPqnVTNhTrf5j8ZwwAilObESexB4seMX93DE3cUBfS+YPFFMBunweoAuA852OEfUgxozAGGPKDrHO8kFo7i9ABiWnwFlHFIvRf5ugO5+3hOIeBDnkNeWAerC27G8rf7C7ht/MeVYPmrNoB38AhmV8fcxxTgPfZAJWNppVCp4ga0ksTHOHVjvoQEp1dayJRl6cmEaRzzYufADozjCASM/sDBKiPktbzKcCyfZS5QntrmAFSuJWcJ9PCL4Hfi14LzIHol9y7gfkCB9E9W6W1o/U71XupOglMWsDzaztpuYVohgfutrP0vYIVTTJ4jJFiBHQYepCDF0POBh2j5y3j5JRNoE1P+Y+TDA8L0T/fAwWAXEAIg2cEDA2vMAQR1sQZ8nGLgYg/m8ROvgEeC3DYeTjl7bc3cqUHqY7L0EAXO0ByAdq+ny4bxRohry61gQPB1mCYBXf8DxvhFknlGqNdr10dpzGMvJqdUeHXBOORZnu3rYu3NcwHGCIiLRoGBT6DbzufboTLstk0596Rz3k59FlU8WDnpK2Q4ydM7+PwPKfVSEX5V+a9LxB8KUBcy/+XRDUwRKHBY7i8XMuXXVeUHBjDdBmlM81oAtjANoEswAzDF4FIiMCpc4/4F9XcXle9lzR7qE02VNfPizFNLtuRX3clzhjP8pim57uMqQV7wBPdU8ISLSsK5LTvTVWXDaPflh5v//e//+h/wQZ1oQ3Mp27JmFvF5PjBk3R525TyHn08Kn4b88tlrm/JlHaTLhjU2Hz78Ee4YYM8MMEyREGFWZAFBKAQXspSADy9aAeECILgxOoCbD2fBbv50poo9PwYfTrRLpTSjXoROWyDPj2IEPu5/g8+cQMVbUXzbSgjglBI9TgCm+asCQaDx7lRUf2Fz/Xt20HuB+ZiQU1v9rSX0lXfmtVvAWQySIMF59JZYnKUefn/lVfoe9DF/VWTBsFcuDTXDbGtdeTnsPXz4o5cbXhizwi3vKxWp2SpXG/Xy+XeFQI4Zr0SYQwFBDisXWkKA/pTzaDOGo9w+eZtAYYTLJcUaj1/a/4ebD5/enwg+Cx8+XQnz+SYn95QGlIM4OwlO8e6KbvHmNwbmRT9xrlmX6zxOP3x6xfpzuSBpnK3wBqFcuvyVPzLDXHgh9eEVmX+P1z4b5zSlubmBXl6dx0AfaCdj6HidV+30tV8UaTuHKb0JmiJmX41SeckTTkfCFpIMg//M40XAFCVxQPkpkj/90pD2+YxyphKgHP5XhtbP4GeweQZCCm7KRoFn8DSg6xvwl5NBrufT5VnW5Xk+LW9YTEsX9F+CvPmNxMDPoHikNALC6rcKUHpvhj7/ewsIAsx4/O/kaz2ckPiQe1qID6fRJu92glXg5Unj5G8noOvOE3Tb13DlkgsZbtaBgIAAfvrpJ/Dh05vd+GfwF/Dh0/V+4PPVQPiGy0tfG+LD/587v7vy+VUffrXUee2011c334I+eeWLMd+x2hlFyI2T2+4r8l7K/wnkL09zFR7v6Pav4usluWMsDXOi551PBeFthW4jLFGpZJhtUz4tpL453rwpS1nyxQUZj1O4xl/KUJZczvLe6WUVVApW4A9gneIkd7ULz8+gkqRx3pVklLMfi264dDXNyR0DBKwY1w55W0uxl3ebqyBlRaeaN2zmUJV1EFDwSSyXa6L4+UeA4tJlGuN5x3al/AuP/MdNMQyLv1fB6V/cBOMESCUAUExxqfRlpApWYKYYrydJAEmKITqACKJiui903K/YMqCr+Ftso3DFyvsVe3VfKkQo+KkwfGeEzRXBAAUp9nicHopNQcBYQIv1ShSiIAXCa9ueyLURyqtj0fytGIdukcUKg+eYp5f98OlKls+vXygXFeEVzAhnQATiDfgZcIyBAK+I5jLkJF8rVQig49wdDXkc0Gx/mk32p3kxxbmnYC+mQNC3L+P1CS33pStrJzgt9I1pger58S7HAsu3lrr/6uQdo1xvcYq+6eyxAQO7NOB5M1wCgMeZ57/CrpSTNN4GuRgBXS+93DVyRYoc8KuAq+BfJh/8lj7rvWjH6TbwLoWvjTYZ419ueQxIsS/JIx8CGtN89KIIpudVXGHvgAFSLN6CEJNDjuTi0veAeZBSjArvTNLYxahc+h6Yk97k9WqC4hzotBjMHSgNvNMYft62Ucx3cRoCgreY5PMai6OcflHq/gzcjINdPrrSHzjw4RaDgIM0WPsc0HhXLr1EUuHbJ+dD599fJUYBJkGZxV6IeRlVSnlU/H60eIvTNEC47MV0lZfJIjtnhICffgLyRCn9zShA/14aF8Y1eIph9PD6q3V32yzlwF9mutOqVUgxiSE6zR04ycf2t+L8kBsyijkGp/31yysXb3GSk5WvKEeQhS9UTjh/lcpnrNI3psoL/InVGe1shV/DecdwX0WSIHxX+r8AAAD//z/qGlu4JQAA" # forces replacement
      ~ vpc_security_group_ids       = [
          - "sg-0be4cfbfac3cc0022",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdb" -> null
          - encrypted             = true -> null
          - iops                  = 150 -> null
          - kms_key_id            = "arn:aws:kms:us-east-1:933752197999:key/9630f91f-f3c0-42eb-b65d-3defffc79926" -> null
          - tags                  = {
              - "AppCode"      = "IMGB-001"
              - "Name"         = "🏗 External Composer (staging)"
              - "ServiceOwner" = "Image Builder"
            } -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0daeecfc25da04a05" -> null
          - volume_size           = 50 -> null
          - volume_type           = "gp2" -> null
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }


      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-046bde70b3986d1ca" -> (known after apply)
          ~ volume_size           = 25 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # aws_instance.composer_internal must be replaced
-/+ resource "aws_instance" "composer_internal" {
      ~ arn                          = "arn:aws:ec2:us-east-1:933752197999:instance/i-029e28b87a6e5ad32" -> (known after apply)
      ~ associate_public_ip_address  = false -> (known after apply)
      ~ availability_zone            = "us-east-1a" -> (known after apply)
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 2 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
      - hibernation                  = false -> null
      + host_id                      = (known after apply)
      ~ id                           = "i-029e28b87a6e5ad32" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
      + key_name                     = (known after apply)
      - monitoring                   = false -> null
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-07088640399f60f49" -> (known after apply)
      ~ private_dns                  = "ip-10-30-18-11.ec2.internal" -> (known after apply)
      ~ private_ip                   = "10.30.18.11" -> (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      ~ secondary_private_ips        = [] -> (known after apply)
      ~ security_groups              = [] -> (known after apply)
      - source_dest_check            = true -> null
      ~ subnet_id                    = "subnet-04a176042c3118735" -> (known after apply)
        tags                         = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🏗 Internal Composer (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ tenancy                      = "default" -> (known after apply)
      ~ user_data_base64             = "H4sIAAAAAAAA/9R76W7bTLrmfwF9Dzz+Muhz8B3ZXCQlSncaRxRJLRaL5lYU2dMwuJTFpchiSGohv86NzJ/5O5c3lzAoSnZsJ3G6GweY7gCCw1reepfn3UrUnBQNKpqh1ZboI5PvcZOUftXc5MkJRX9gArIvIr9qP12pK1UWNRtIM8O9GtCnIURVnZDiI8Nds78b/G4wHD5f9LvBI20pqUtSJ02/1m8aP4xzVDR/YB4SjAo/R5+ukiJprsOH3dXXXVblF/UDqoZyEZIoKXYfmfdB0jxb0LPcoFNzE2Kyj4YhKR6S3e8GapKjb5j75fmawWBfo6r+OGCYIUM5+MigkB/SwQHDMExdx/f+volJlXQous9Q26+l/4bMVV3Hw6r2mdlsNhMF0Plzrg15mT5KM30mzmaz+Uyfn9IHZbXCi4d5MU1CvGxzp5LFyrJ5vJk0mbmwOFS+j+Z33ZFL3YlTxDq+26oluqsScAJbvPgQOtr0xlBKMWK7qXIE7a/Zwy6ePuxb4I6mq19Vf6K1FhR34xgQ5fRgbBfjZNmEN6aOi0BWktvSzEY4KclI9xqxyXezz7vMnE2kLm53wWQ/VqfJyVqdRo6Y7k2VXWz1DqQlemgTZ/9rvTJ+jXm70rPbmbjfr1w9qFL8qxLD3N8cqkNrafy+1ppD4YppHNwdW+0979ylfnkb3Uxjy/98J3NHpZ3YCl9sw9Hd7sjuEj2Y1EmgWN17YKGTI4z16YfPpa45qnsbljuvwqa/XN56pho3nfZejbxK2yj2lpjcDM3a0S5uQlBpooWDsXm4ey90HftZNBQ+nGsjjT2W4+Px8118OPJFEwiltblrItSsf4VjVr8rymLbmmbhlXynHEPEc8H2NHlfxFNcxJvK26XofUj04m6mnG5CLExkc93ukv1dKB5/zbgP7h676tb+7ItNdlxvMiOVytTa8misrrkJkd7X62U4unHGWfuwOURqDePoMzffLhcQamVHdgE7HUM3YY2tUhaeccMhuJvfGL86sG3cB/cDWz1ALYxmhF94D8V63LmGvV2vp6qX+cXpJMjvbS3J5DWY1nbKs2w3mbctu3pYfbaCNSeOH94/RIIfGtVmJIWuHSmrG05sgTNRuPR96CWzhba+BUG3VVhLaB4+nFjE6Z8+Mbmfkuq/KhTFfnMdkvzqJd5RxI/H3LTH/PyMeexJKw5Y8piOre5ELlXwqJwolpicltbkqGWT7YcivfHeI3IHdPlGZY+3ow/jW4YE+8hPXhw2OFZJg+5pRLi4Zek38UfmpsnLs3vf0xhxf/CruucsPEeBj8xfL4xqpmivNtL9XFPVlfXpgxD6Dx9YFo35MT8KRtzo4f3DOHgY+4iNhHDK8eGHKTflL7vnmnqnmbLxuP39wxgJkyiajj5wY/bBD0cBK0yESTiJhGkQvJ8gHn3goofXh8/u57JhfdqYbLMxublhR2srESUDrm3T9tY6q9hGP8c284xbm7YhQxlIuuNtPVYRTHsteiyGtgR0lXc7AMWFnY25gPdYlKtjS8p4YxHbAW+IEWsYjl1uAq5c+0svtTLFMOzjrY4VMWK9zwaEQM/wUrcUaNiKELGnRGXHpadEdciVEth6aeAAwVzEqZVxn/VtdAdlOLGg4SGbk6EFtv4CaNa2FKNjSedGL+YyZWvBtRGxsHBsw7GhIhuywka52pqpEkMhrqwFO0awnOgsEG0WC4aieGbWHJwMkygH2rzneT23bUX2+EixZUXu1zpTiT7rmQL0QqwcqLgmBKrbxRvHKYENcYEK0dBsIKrceqPm0cqQxJO7Vboo3d26cJ3CTOUBVsdeFp8M2z759gk68gdBldYGSmHn8yVRhfJkLfHSTmPBxu5hw4O16qxOYSpCBEvLZU++yoUChGWrHwkLJCN3BdJZWzwKFDCBHPRsTiz0DG/8RSRqS6UJcWmqzjR3HaNFS2ha86YLMk82nWakCmHldsqtB+FezUGtKlE5x5B1pPXS4DzJwBGweOXgZUblKFAyCrgxl9Gt7UQLa2l0pgx8xwF5hCPHVEofZKNRxEZHFSu+Y63GbhdzwVb8rMLZrS17tSOrI2+h+JbMxY6CE8MSgbk1HFUGK7MQBYPFR7fA+wBiO5g3nVFAPpCMA1xwLVqSA9rGk1A2eJhxd2GmrAO9HAV8LYQYNnAJM2MBFZtbzy0+ElW74VybM+ESxuZWNIJunQWCd7rtZicjdzvdHrXQBmLEQlF3FA3K3MLYRisbYnmOPVOVp3MdY8XIiOBZnqsK2dFbTOvQnN662CvdDJcRb+xtblaBjJtrciSqEGbmNjIcm5u7trIw0wgDvOuQJWYBf7z9wV7xca+xjRQ9mQq27QHd5ua6446+71enJ4zqu1I0ipIHPMYmG44DpdyE2aq1HM73ZeVkylhFzim2BOyEVigYHZ5bcG0bBTg6hc2qy5VgcIbgsgaJ8h1n2OBgKkoyz09VZIkusKeuxxq8swTzcDFdmMs1r8rNnemcLMDBW3XrHsGiPpgYF84yrIJFacOletC25TFIYxPmpyZc2geD5e4sy761nfXSnjean0I/7GBusN7Wl0eCZa0422mgJq1vg2WMzUyp7W280vmTZC/gyM4AcC1lDLYzAS7GhSaJGxNHLIKirukla/MR0IuZACA0PecDC2x7ZMtlaxazzl/iA1DWIw2uDYNvWuQA09xGuZ7FvC/EwMy9fcirgmNOeeBgzkjjBsncZJ4C1s3I+JYtx4atcOaSnNws4kIbuLeCcmtDw47mUyPo3DbKoq1rZ2Ob8zYuVkcujFW9W2ugUFLfWZ/C1B55qSGbmX5rFqC2zA9CuATjMFUOYGuwbrbeA5xx+ladzpNzTDbssbySgWJjY21kWNKhoZxjOXv7TaaggV7nYRstcO47II4W9mSezHaruSi7WyPWdmS3ms/OH8XDYQHKgB9NVpK6u5XEkZpkt0/zc9HytuvSdY47q4CNm8P2xf7zh1clMtIsMnI7clS7EgOrzEFXZqAjrCaVmduRk9oRzpNI51rk6KZkDPrnMvOsMvYscgIpOWlWmYAX/IHS48dxtIStZ4pisIgOYY5Zf8FOVktAXGvFARyV0SI2bVZRghy0aCuyvjPdn2U+f8wt6CIHtloiSlbKHUJ+zfnOKdvk09Y7vtBHHCxw5m+N8fP9/UceH6K5OPcc7xDm9mQll3GQzE4q/UikBRZptfmsVaXVaSVHAM5e60nUAkHf6Y7HetvVTkvEW9cZ7VRrRj8TNbUnarrbqemsU01xaUH9hR0iZ/3ZcwCrJSIOHKUMZCXzlmscCuo0EEASObj2FrANWbH1HIO4W33v8tPmuRy2ABM/h2k0F/XIWde+o+5MHo5XMt57+YfJNzIrIufmp9JtxY23zXa6cyoCYU313WiJ2Ib8j3X+jHfTZuWdvYRJsMDpxm4wssjuVlodgbTbuTlmb/VvMNV/LGeaRc6JCzty+735y+eoSmUO0jLzpDKlttCsMgYWTYxkrEmEU1PCgpTQJgJrVpmqKaE269T0LboiBimlS8a9fVPCelKZexYRVIt0bkd4Ny0TYJGOYt6zKH3CuVaZetab/I49yldPp0xci7RuRwTqK2pKeLpflciJ8n2hRX3r2PP9Nt3WkwgPOiKoUplSuh7VQVcmdAxIZe5SvVA50jJXJcK6KeFVi3Bv0xVz1+r54T2p91Oqi1ajZ6Sko/x5vX4of2VC+XSt3s9ZT3qTX0qLVa0yVzuaXMtcTcuM8knHgERaN6WxgcYIMnatElM703jyE7vFbkdpkE6zKM9l7nZ9bOKB1OsXuykZqV0vh+BaZ5t6aa/nt/hl+/jUUTyVWO3IyaP2OWPuSPn2UsJpZ722qtXHBM6zyBG8jV+BYtPtermOmkRpl7mb9jg7XWiMVYvatowpbijOPIrnN+mKWJUIf/GFkSeVMZBKDDoy8s66GXspxV+J3a6nxasUzymV6209nGN4iSnfVI/U3t7Zvyh/I3CJ80AiHEjJiMoA0l7/b9HtMaP2uiAnqg8vLWO1P6e3IUtldylm6Dhda5Ej9aWf0O31RfWpSRSfvXyCevbBI7WPJpERxbLaz/V46IBUxu7bdmM9i/ooadWU+kKPjZEm0ef+rF7XGsU1tSnVC/W7lJx+Yrdc63FKY1eZuB3FPeloDKI47nHXY+Ps473PULxRv3jbjxNw9vu250U62w+k5KhaZaz2sa3MqC+6aZ+zj9Q/VOln8WHWaVIfI0fUD1war6RzDaBJ1I49jo893izCaef8T2NU7L3pxzMa/xJw/H5uMLbxMeDHOCj0yUpyOWCpwmq+OyJJPqrS7PQipyg7TpUwr7YiRksDB33NM+6+rWVEF1izcZSqOz1XOpofdX66DwWjdR28j5bqZLUArb81SpdX6h/kO0m3yoVunyzjm7z2lf6zXNznVtOhfBmll2McpmT3fdozHkilaPTxuFwYVikbVjlXrVKmmDOkUqF5g47rVjnXzrlpTvEDKE8W4Y20VIy0FFWrlIy35N9C1l9MqazjldxgZIprbwH357qS1lKz79tu0WDk4ExLsaJlhqJl9lhLI1nL3FbL9JOWGaKWrjgtU+b9WArnWmrzWrritUwdaWk819KZoKWuoKX6SMu8hZatxR/oWva3a811OKwl07dru2efkIet7yi1loKFloadltGzooWWRoqWGgstlTktlTst9RQtk09a5s37df1avdUyT9Yye6SllF+7O6/Rj/M39NnXWQrsXCfCWiKmfR3rgDj4pk684HuBC39rxMFctHwn2rtbgwtzu77YgtZdZbiIcZhz1Ae+sYUj2Udt63YrGY6iBdx7C5hd9sKQVwrP+hHGRNtS1B3kYbJSAA4LD4eJKEZbg3jOmD33FPgQvCHrM2yLwdLAYT6me3jPFC+2+gF2ZEOzuzINeO4YCACHyfilPdvjzpDHllYAlupxk4NDsBUP1J6bfNq5BSyDhb4PhHWxmYuyhdWJu426t9ZdeqPnOn5d53b+Qm6B5W39rUFsDETDGadhgY/f6kGMtd7XyFilvVDa57G0r23ONRzNETQPnh7rSBp3ab1A83Rf91h9TflCPy6vTrTFauKl8gR0swng7YlnzSaeI0+83J6AxWqiWtlETbOJJ8kT17InnuRO3FyeqNJu4i3siWbpL+v7BcRauqP4bbV8HWu5l2qpmGvpbqylM+qXmZZmx/MamGv5OtNSd6TlMNZyu9VSuj581Q+KNAeNae7oez1aH9K8RWWSaK3U1zJ9/qZ1IjjXDmOP5guJtB6tR9O+vnkhv+aoEy/VJ8BSJ26nT1xr1+tCzd2J59gTtaNy2hOXtycafbbkiSbZE1UKJ24X9mNeOnspvzRjtTTOtFxltVzJtVxntVTmtVwfaemq01Ix03Kb1XL3pKWrkZaGvJbuOi2VWS11+X5fqp9e5ZAxrT09qe97af3Q9f2v1T/TupPm9BT0ObuMz/mb8LQ3dlNy9Giv0ZWJ9qqeUS17AlJ3olnqBFA99DJSuajd9QnoVhOXpzKvJsAKJ0CiWNlNXMuduL3eqPzuK/srqZYriZa64z6GpdlYS9e5lttHLZePWuqyWrqisnZauuO0XG611D5pqZFr6WzUz+cy99r+QCoT9VynnvpamT6nNPf3ehDU810Aq158gNZ4VF89LqS+rqR1zUv8W+FE7WYTlcrH2xPV0ScqxfaC9szhxE3diZfLvR5U6iuS3uMddBQ32QTkFCOrV/bf8VoapVqqJFpuYC0NWS1VsJarnZaqRy0FiZa7/DkPhK2WrlotpZhZcVoqplqKcb/3pf1pH0P9OFW7vh7iejxYvc+PQFdml36U6/tT6gNU7q5M+vq+H6M1+0v5qY97uTsBC33iSfoESGovm0r9ILcnbrqaqDkdl3vb03jhSbMeH8BaTTzre/4PYi0Nx2dMz46Pl016BpemPdrpLDShjBemDUQo2/3cRi+BaWMZOaWks0pr8pEYsXiuO9EaQrwObE685XadaomfXdY+qZInAcfIVEFmIRslzjaSbYhvTX7qm07Mu+xYtG2ozrO1oW+jhZ9BaNnrtcHKJ2hDMRIi1U2B5jvGNlgCX+8g7/JcGrExcdkx8DMoWNBQkM3Z+hZrUM5YyPdfHEyMbXhL5yL2+VwpBjZn2dto7XGv+HCauZHHzvMvChwc3yKsrMz85Bt8TDxZ5fwdxbMoeHyk+DYnqnIk2YKytFmcqKxhGPZatCEUdctY65kh6Nuo8Fi40Z3pWs8Uw5BWncsqx1CBlgNh5Vgr3mWxMc84zk3Xlc6V2oYfK9pCFuCWCD4uY1TMWicHSSCATJXLU8SuibstDz5bCnan7F2WO0RwJXjSrAphqWsyZH0F5gGX3bp47QV2A8K2+Wzz63nkgAPAhulkq5HaRWMViitVrnnAwyaydVZdKhMkT7dqF382uPUJpAYIHMgDc1pCh+3gFgJPLycuqyibTiGWjC2Yw7nKZSN1EX32k7ozoOeGsrcPYex72ajSC/HoWOsKWDoLnJEQFkBTs7o1F83BkuBna6voKFeO8zyWAxY6Aedtncw46pw4R7l3iJzVyOZiVuen0LDHtamUiWefKs8Btz47lcwtGJlLl1WXawU4yjoU7M63wS2QbDYowlug4ATZ7sFfKo21LAvLBmND3nWm3KwjBRfqYp1ELPbggtM8Nio2gqGBDohOEUG4wIbHKifTgrnHg9R2OAw5hY2OZatu5U53IqBnimjwZeGlseDxnhCxhth/+ZSKtg6V1YZdi+Y2Eg1ZyfQ80mAWG0CGC49ToJPVrGNOWVDsjkEKDnMcs6EFAWDl0y3PHqJ8mmrLCNoQyxCvjn62VgIhskxbgUGhC+HCyy1l1fowarXFiYVs2fn2aa7mxnrTRSdfjk42zG4te+0h2ZN1COYeO3b0TAGWrbbatvQC7B3dLDIiZ9WZ+bjwFfngttNsw3uVpniKmnrktgMaSkVe5ad3RjYlqmyI1rHsaZmKPNIzJddkONdtTtJzRYxYKFx0UOuZIkQsKBwbbyIOz3WsQFNWBGMbOY9y2dlaAcvINm0M5zhrta2RGh2eODheU76sHGeQP3VOpnJRDhrPBssgGx0dGGWBfGqswkscec273dpB9qn5Vq7RrcfHxF/onbWFnppi1mXDMcKla27hd7+EfP3FoA4VxZLXhm4b1Kfnut0Uql5WEYtTVHiKWeit7cAUyrpg8spK3Ropso8jR15VQJ62txwY+cLs6MJ4GznRZ8853YEMw7BYjQzJqHQu9nUWu6BTDvPU48wCpJEcpYZidJrdtFAeuz7bHNESnzwJSpqDs3BJjtCKraCLrY0AgQ3juyCPl0a2GnmOPdIh0JBcH6DtsR5Pbo0FtJHcrFzbWBj8WrFhOdEg2ESd3vp82QY2l0BBKc283EZtY0f22gmcurVzuABbAF0BnHTOPVqScQzx2tG2yjjclTHMpr41bySPKyU7L4lrlyZcRsQXxMwWypOdG0YozATXASMrU1ZB0rBw0YjWEp9cIRKD1MhMPmSDwuDDJdZNCOA8Vw/BEoKAIyOjyzhVjjtrG91tOGy7PF4bdmkgBy7VziNRZ8zddtrY7K41stKxc+AYS7CFmRd7aXiAC8M0FmDkJ/VtyGcnHSsdwkqj2qc6kLkjcCJBt9jby5fkipXpP8iB5NPrL11Mc3N/K7vm/cwAn/yq+Ogf6481CivU1Llf+DtUfdzXQ+TXzZD7OBWE92Oem76fTqeXVR+TokFV4eP7kOQlqVHVv94zrMmhGmWX40xbNOfG6s5aaeBenYHZ4vJmwAxI//jJ9T6owyopm4QUw8uWYUjy3C+iYaa7mEwfz3dNS1bvl5ppgZkq398ZsrLafqobf5cUu+GjCMNHEV5rSVoZn25QE96QOtgnOHq90JTnhmyZT6LJQLrTVsC6t43Np7hpyvrjzc2hDNGQjTiBG48EdjIeTQMujIbT7lS978aH65eyXz/Jfk03Xvu535HCP9bXIclvHhncaLbkzKz58n6jLcy3zuUQK3CBP2YFwQ/YcDxEnw87cjrw15js6p+e9vT+yPe08M3AdUNy/P3XSv6ckTT5y+XBx5gcUXQfkdxPipr5xPyZuWqQn19fKF6Tanf1n8xVvA+ugwodX48fSZWh6tsp5vGE0Gc+MVff5zr0h2HVXJcovxo8cncm+Hfz99/GxytN56RImir8vip/YVQ6zZzfwdtXPnUE5oFUzCr3d4gR6TGoYpKCmTnm9dMuiYT1R+YRHnl/Rm/n/n83EQn3OSqantx57Dpucjx4IjCPUZgx6ICqlhFYpkYhKaKa8YuIwWTHNISp2xqT3eORNWqYyEc5KRiBfTZGF59XfqU9oypn/DBEdc0cEp+p65hp9kWBcE8YIaaJEZM/Sl4TjJ6fQ8WKmJJUDcN/4HjK1GWW/tvXiPGjqKLEMQl9HJO6eTbvn0+P8qT42B/xlTGIquShZZrYb5gj+n2FmII0DPKbpNjRfWe2UE6qliFF/5QUdeMX4RN/86U8v70EI+YdjUZPRycPj3v3NbXdn5j34//xjDFq1TETtiFG9bPhJkYFg04oZG72dXXTi3QTJMVNSTpSBaS59zGqnkkhF/W+OquwIqTpXxmt27pBOZPUxe8b5mGP8Ut+ldVGvvDcb7mbWUvm5jnndemH6InxD+y3jDdJ/oLvY9LEScFw/80ivXatv1O8pwxWoqpOauptF2kPfnWDk+BH8f+fQAtnn7x4SPLAHBET+gVTIT+MmTAqrr++Hfg1EgDNkv89j/02QsV/fGQcxBwTjBkfH/22ZnaoYXxmxApMjCrEBCj0qf+QBybECdVNiKqmfqlNCmqmihG+D6OCcVbWkplJkiGb5ismnmvuwU8weu6mZVLs/gFlvEmSRoTRSHg+VJGGhASfQ+Gzibrxmz2N9iNWeGUupq4xQ/qSo2Z+Y+azuWxYK2U1n1kyRdIlbldxnd+E/s1Z3uEelTS8M1/+IaGeMsJPhf82RfxbvzTw6/jJ6CYqIqbfU1O8PJK5fplVfl8zqDgkFSloLmAOfpX4AUY141eIeUwRKOqh8fFp69+dVH6RAVwZGlBlYD2CWbdlW35Rwnzeo/3rouR5RXiT0IQ3DM4Jb/go0vBS4F3oqrJpzhbyp6v/+7//1/9h3qkaWFn3MpSB1fvnZcCUDbiayzSGX0Z6TPvN46M0s+THt3kN2bQ31qd3/+4fa6b+XDM1KqJhjuo+CgyHPePDfYWZd09SMcPHBcOARC1z9e7C2NV/XKiiMCbMuzPtwaDaF2EenV/iDeOcRMyvp78BM+el7HuWfV1KDJlzSAwbzKCCWpUZDgtyPCfVN3548Pf8hOA0rGOE8blA/9FvCJ6hk+buIdoTpkxKRL13UJN9FaLvv7E8+IVZoOZFkmVW0vVgBUxrBuby/Ur69O7fQ6r44abuYfnx5oabTK/58ej68vcG+w2qm5scNf4w8hv/5pHWMIn+g54xq2uUU/3QMqHwc3Q9UOzN5qmR+HT17rfv9xZfhu9+e8bMlytK7q5KioYh+zPjBTo+o9vb/MpETV9PXHLW4zT103e/vTj6y3VP0rxo4dWG68Hj/6iRa9QMn0i9e0HmX8PaF+Wc+72AKujJ6g1hjCU4K8NAO5q1q5e46MM2XTN45TS9z75oumjKG56Hhgcf7xHzP6m/DFERlSQpmrMn//ZWu/flsuVCJYno+p+0v1+YvzLpZ2ZYMVfXZr/PbKqk2F0xfzor5Hmne3/h9f7S6V6nNSkGj9vfWnn1NxJj/sr0RqpyZvjwtzIw+F43fvl1EjMc+vuG/CthTUIlJi1FWobac2tDq53kIQlp0Djj7bzoeeXJzGfP110PAr9GkxEzjJgh88c//pF599urnzZ8Yf7EvPvt+U3Dl2cN4atTnuran5zx4p3a755wIfSzczLU/v9zm+9eUv3UV15cQ710judTVz9afUb/k0Lf0B1VDtXdMz/5zuH/LKAfyKJ5b1qaQUugmwgdbopDjriCG5jWzJLPd1w/7HNe5ad9+RUjdUMqf4e+5qN9+ThGi6inO6FB8sD8G7OrUEmx8HjmF+amrAgtT/ZFU/+hL4sHz9o6WTSZpO77tpbWtwUKadn5kFR1X7LSys1aqbLBJAXzG3t9LbDslz8wERk8tmUNLd2eCf90Bv0XVMg/31I+JOefKmKESoYbMExECjQYfO2tkgdmq5gvW0rGxxXyo5bJ/ahv83sZTw/1fVI8kB8dm2cP9fXpoX4xP+hZ6M9T/ew7vSwVBDFRUqGwIVXbXxkkdZ0U/T1LnkVJxQxf6vZMbhZFNE32VeBD3fhBH856hdOdZ8u+++0ZL19eWoiyGqEHf4+bmmEZ9or5K9MgxAz9Z0QpD5TkS6F6BgxE4WjKm6TYn85NyuncOFaIIgWFpGCGxuGpzz5vo1h6pu0SVb28pOi3hjE50l3M/WtNffxm5DtKeX6d0xdQF8QmNXOskoZWxQOGacg+jF/svrkuK3JIKBtJsbsPKTSoIH0M+OnCh+SfJh78LQXXV2/HZEc7Kerk1PK92Q89EC9/+itfGoP7yLLHmPnjHxlZUwZ/Ph9UX6dkXxU+jv4yaNoSMZ+Yq8eRqwE6hXgfoft9kTT9NevVhWqNqkMSoqu/DAZ/rpMiq6/JvvlKwT/W9z3zR78J43tMdvXVICnKfXO5rH06gvnL4DEd0Y3vfnvr7vzL1WBXkX1531fMn5irb7/kuLSWV4O6qZCfv7Wyv+G8GqCLVa9DEqGwl78mxdWAKmnwg47srIV/Ucx8jVxnI16qplmU7uvm62xDGNxfttFs4TMFKWjfXkR+dbnH7X00qRnc39omGcIt3RSgwS9MHfpFgaI+opUVCVB0PfiFsTRJe3mvVSC66HyrTINOlYTnO5zLVW2BmiOpMgajA8K02a9JTun3gPlPJtg3zBHRlPD7hon9A2KShqmSXdwwBTleD56ib+8YZ2NGl7/fJNOhXybXNQkz1FxHN1/96e/aRg6oqpIIXYekePiu35n90r8MNr1yzR6mn14+TT+8n/T4+wq/8z39sEKY+NG5aUWlX32bj35PFZmTBjHnLz+erNzb4sxnff2Mcu7X2ROV857/4h4d/EcO8Lj+fNRl20ULP9vzHcV940nD4e8G/y8AAP//A7JFD7RBAAA=" -> "H4sIAAAAAAAA/9Q56XLiSJr/ieh3yKG90TNRI5AQYONuTwyHxGEkjE6gt4NISQkSSqVkZYqrul5k/+zffbx9hA0JcGGXq7p7YiJ2xn9sZX53fre7MWGIMM44JOgeRBlmQQJTVo2CPfJ+BE6cEQ+mh4eyMlSkzsRUe21tXi7lX5yFUhrE5B4IFf670ncljrsG+q50od0LaBLTgBWwkDHo+hEi7EewCjAiMEIP5YAErOKu1uXPWEYKCV2hlJOIG3sBWd+DWydgVwCFyAztWdXFceZxbkxWwfq7khJE6Avhvr+GKZUyilJ6XwKAA7kE9wC5NS4/LAEAAKX+EmbMj9PgiLxliA4FbP7DgTKlPpdSCNrtdrsjqkfYFQ5uTco/e+1pu9Nut7vtaXe/WcnDIe6vuqQVuHhwiOxU6qSGWcPjJgv1viGg5NbrPh13wmbetIk/xU8zJUFPaaDu1Rnu37n2pFXV5KTj8ceWvFMPH8LV2m+tsoM6r7eGHxTYnBwMq7Nu+Gos71farN8IBsyt6lNMHEkOHhM9rOMgievTBeuwaN1+Xod6u9k7+oe108waSivYG8N93e5sMl3h+7PpUd0kaHUI7OwDHWof/JqZTsPHdifLhvOpk27wB9m3IjjeptuDMalldMK2ZN7Z+M7T7jC5rdlPG5g8etWWb8DnJ0nYyYemKdfIzK0/rXf8Opg6TRo4snG8VQ20t8XGtHX3nEwntjJ/dJP1IsU6HAweF7ris+PkVvEW6WQsm7NYF9qofaivfeaq6aRjYKehb59uxeORf+5ocs3tTuoTfpc0drvnJ3+7qxHmiIkxfmIeYqMPVoOfPpGEzA66ThZJ7SjvXFQTnNm+eUv8Fib+OF2sN+jWjafkqS3vqy4Wm5I+OqyD7Mnt7D6Ewt08w3NlZj7DDgt3o3GobXrJxpjVUEMZCc24d0tHA7detRvhYTXeegq1fO9Z6M4GfcuaJMd47fCthjUPeG0mJ2ShVQVkrbtV7YNtHdh8Nb/j05U1cb12XOsvVmTUOM41czYatZRFCMl+L0q35iQIpZHaouamxvPHZvdw4Ier4bPhjIROY3W78kToaum43nPnpicPq0LnoNpNWdjcuoug3Z+MHlXnOJN5Q2Sruz2PhOnDA4jgJk7/niLPh6zixlH5tb8jr9ZoCK3C57snn8eL3lBQDamRnw2fOsJGxvWkKRudYD8wmrtJ2JzdkU11cYviJ3UqVRV+91i/azyC2Mk8GLxiVtqlAUPLPCOcwzKBzL8HVRYlp/Be5jliuYUpLSRzT1ngHvx6FnSid8zhuLfsThRlaDzciS5c3fE8atQatbpTF+qr21XDWTUg4j3RbQk1964ltGpn7O5EeZroknZBv101kNj0vFb9TmjwK+jWHV5sik236Yktx7ltohq6E7zVW+btZVfSjIexzrOxLnQ10xsZQaenWSNTNxejKS+bWnHHs24ojHRTkyxJ7U3txWzBy6JujjoLHltmT50qtflRtTp9M2wITm3Bo0hpGL2wpvV906lpHY/XNNtMxo6QjOBgsTFCWdPM3eMUyx2PXzxrlqVOQzyYGrKlmbLo8ftA4RvJQvaoKyQ9dbbYOLYq6n1/Y4TC83TmPVmS1TQsbYFMQbIMdQb76sSYJR1vl+R39Vd3oTwzrJHm8RaxTc02LVnSJJn3IuWgb2TfEv3U6PMNZCXNKa92TB6Lmiwv9JBt7RDHXqROuoXMo65pytKi5smmJEsFrN3q5d/TUFanpJPaljzXLVWZH/2xbSeqaWGCSEebmGpHEUZjJfKGWq+zn8/ko7dZP86t0cYKlZqKlcYi9Peaae6hubds6U5UeiMNbawjrCWxIiZ7Y4AH5sYXTTzfjmvqSLGHe3fTsZCVGHN+DxXBFS0rOUx3Ma/2tGguxkdjhuuOrDYtwVqYQodMQzyGfa8zGcjMxYmu2K1obmsHNLB0o8uOTriQdJvVFdFN50f5cWFZmRKpVJG9pIst3u6NBpqw6GnYU42avF2EWmrLVk8j1lgfeI+m7fWNgXbUJRXathp52LN1OYFqWK97vLdTsAxtY9iYH33BmXWeFav9aEoLaktKfdGXoSEJvi3jQDM6qj7TbEVShzrpiBqPd3OCM8fCptNlR41YNaenba2+cECDeItmftOVtJoVCk9uKI+caVJ3alR0scWsgRVqfUs2hVHXqHkdxWTC3BR0a2D5+qyjOcdR6IiL/eOxvdei+XFq1g+WqXY83upMbXliSUJfm3lD08JSFy90RWp1pxjLWhiLC2MxV8Rwt+i3qKu3Hud4kcxDnHg1LTOFdqqGQncieR3FskJ95mm2KXTnptzXNx5W8fqIjE7o1HaPX8HtXHC1mSdPg5Zomgt1agrdqT2vvx9X+xcfna6TjkaSmlrDWOfdhiMnYzccHgxbgFCS97qEFWTvfUPEtmu4onbEXcMamRpRdzYxeWUwFDVBE+e8FnvRWtBMdavLctCN9qlndOaq2ZoveK1mD9Su22/19cGopkjsSbf3hipYj8psvlP7dKtjTOyBmzr9xLQGynYyS3bOxtetaM/cgbnVeOHJMMxH0x4NzC6bwI0F3aMVafxiBqW6aBhDwbSZNemNHp2Bj/VQpubMH05r+57Zt+pmqKpzQ26os7Zo9Rtk0uuMdezxyOpMJ9OEN2ueOiVtUbUsfWHf8app1k0pOeikfYQDvFXlUX1ijTStxg7IVnV95kXT0K9B0Vf1aJG5NUW09VZNtbGgbXyGJKHZ3aj8PIwbj3zS0ExZ0Afxfh56gmuq80dRfjQtzfS6Lc05zg9e6M3mZtgwhcV4jpX63PKV6XE0UYm8gfZo727M+mKjSXo4fdSJSg39TnQHasPdyFt1pvHzcJSpOBSmM6XVDU45WTMb0lBSZRNrIy3Evamlyadczj++rRS6Pl4+SnN92dbUB5iSe7ij9xS5KWI0ggSuUXqfUQ5ByjjhviWKt42a0LpttVpnqPuAMJQSiJduHCUxRWnRaXI03qb18MxONzt6Vxs+GcOJulTaart/LlJttfePc6aZQ900SPKenDujcG4cRZB4XDid47h14T/XDUlZDia6obYVafmkSfJw9kAZXAdkzV1U4C4qvLVSb6g9VBFzqzF1sgB7bwF1qatJhv6imqT2niZD1Via2vjBZyyh99XqNnERx3uCKDTqIt9s1FuO4Hpc67hPb4+NbeW17pUX3Ss5YgVG8BgTuKN5q1G9CDiemD27bXQHy/Gkr3+Lr4B4UXBggxdF6PBug0PP23W839YqOF7T3+T20sq8Z4UvDiosjvD7Hc7PYbwJfjl/QIzjHfKWXhzBgFDwAH4GZYZgVDlTrMTpuvxXUPYzp+KkaPf2fBenIUq/vAIXDi4ED6D8vtQu5NyUVRKUt25n6U4E/7B8/zQ53lg6iknAUvd9U34PlPwanMbBLIV5IIBVnIJhBNcIdHI2KAUBAW1br7xg9WKX3oOLe0QFj+Kdi7+qXuxm+WhbkDudVXwW4dILga6P3BCgLUoPQOQBRW5MPAog8QCO14DFgB4ojtcXlhQx4EEUxQSI/NVZDnyC/Ey7nZscQNdFlIJtAPMxFrCMEIQLwggB5iMQXTSnMUbXfHK1PJDEKQO1O6GWC3W+zX8yigD0vDQnjmMXYj+m7Ooenrh7UUDuCxafBbNQGqwOgPmQgR36IUWAxAwgyAKyzvFOYqEoTg8gJsVXQCiDxH2RrzuQuo/nZARu8mz0wjpYXXAzmr/d38Bt4z+uBMtftQHcg4sRvTpmPiIA7ZELqhlNq4VKVScg1SQ+xqkTsyXEKL3SQiI0S08mTOOYFdsLeqAMRSCg5AcGVhnGr+WVh2PpLHOB8tQ2BqB6LTlNoIteBL/jvxScBdEruXcB8wMChH+ySm9D6w+q91LBEpTSgObRdtZ2C9MqDpyv5f9/ASucYvIcIcEK7BBwIQEpgq4PXI9UPg+qnzOBOjGkP0c+PHiI/OUe2AjsAowBxDt4oGCNGICgzovARykCDnJhHj/xCrg4yG3jopTR19bMnRqkPsJL1yPAHhoD0O71NEnX3whxbbkVDDC6DtMkIOt/wBjfJJlnhHpdvD5KYxa7MT6lwqsLyiDL8mxf58U3zwUoxSAuWg4KPoJuO5+Uh/Kw2zak3JPOeTv1aVR1YfWkL5ehJE/v4NM/pNRLRfhN5b8sEX8qQB1I/ZdH1xHxQIFDc3+5kKm8rio/UIDINkhjktcCsIVpAB2MKIApApcSgbzCNe5fUP9wUfleUq2hNlEVSTUuzjw1JVN61cI8Zyh725Rcd4TVIC94nHMqeNxFJe7c4J3pKpKut/vSQ/l///u//gfcKBN1aCwlS1KNIj7PB7qkWcOulOfw80nh05BdPnttQ7osljRJN8fGw82f4Y4C+kwBRcTjIkSLLMBxheBclmJw86IV4C4AnBN7B1C+OQtW/suZKnL9GNycaJdKaUbcyDvtk1w/ij3wYf87fOYEyt/y/NtWggOnlOgyDBDJXxVwHIl3p6L6jR34H9lm7znqI4xPDfrX1tlX3pnXbg5lMUiCBOXRW6Jxlrro/eVZ6XvQR+xVkQXDXqU0VHWjrXal5bD3cPNnNzc8N6aFW95Xq0KzVak16pXz7yqGDFFWjRCDnAcZrF5ocYH3l5xHm1IU5fbJ2wQCI1QpyeZ4/DJIPJRvPr4/W3zibj5eCfOpnJN7SgPCQJydBCdod0W3ePOyjljRT5xr1uU6j9Obj69Yf6oUJPWzFd4gVEqXv/JHpohxL6RuXpH593jts3FO856TG+jl1VkMtIF6MoaG1nnVTl/7RZG2c5jSm6ApYvbV0JWXPO50xG0hzhD4zzxeOES8JA4IO0Xyx2+Ne5/OKGcqgZfD/8b4+wn8CjbPgEtBuaIXeDpLA7Iug7+dDHI96S7Psi7Pk25lQ2NSuqB/C7L8O4mBX0HxSGkEuNXvFaD03jR+/kcZ4DiYsfjfydd6KMHxIfe0EB1Oo03e7QSrwM2TxsnfTkDXnSfotq/hKiUHUtSsA84DHPjpp5/Azcc3W/ZP4G/g5uP1puHT1UD4hstLXxuiw/+fO7+7PPpNH361HnrttNdX5a9Bn7zyxZjvWO2MwuXGyW33BXk3Zf8E8penuQqPd3T7V/H1ktTRl7ox0fLOp+qhbZVsIyQQoaQbbUM6rba+Ot68KUtZ8tkFKYtTuEafy1CWXM7y3ullFVQKVuBPYJ2iJHe1C89PoJqkcd6VZITRH4tuuHQ1zUkdHQS0GNcOeVtLkJt3m6sgpUWnmjdsxlCRNBAQ8JGvVESe//Qj8OLSZRpjecd2pfwLj/zHSRE8LSdXwemf5RihBAglALyYoFLp80gVrMBM1l9PkgDiFEHvACLoFdN9oeN+RZcBWcVfYxuFK1rZr+ir+1IhQsFPgeE7I2yuCAJekCKXxemh2BQElAakWK9EoRekgHtt2xO5tufl1bFo/laUQafIYoXBc8zTy958vJLl0+sXykX10ApmmFHAA74MfgUMIcDBK6K5DDnJ10oVAmgod0ddGgck259mk/1pXkxR7inIjQngtO3LeH1Cy33pytoJSgt9Y1Kgun68y7HA8q2l7r84ecco11ucom86e2xAwS4NWN4MlwBgceb6r7CrlSSNt0EuRkDWSzd3jVyRIgf8JuAq+JfJB7+nz/oc7The5wNUHuT5yxfPvi0c8fyr2PTmKb7ILBnG4KefgDSRSz+fGNHKJs5SArH3S4kdEgQeQPlyUi6hvYszDy0zErBiu1o+U6Uo3QYuKv9SKv1MAxLSSpyxzxTgji4L4XeQuf4Sx2taLgUkydh5R/vCAvxSulS7HPHm47dW5p/KpXUaZ8myaJQfQPnL/22cJ8pyibIUwehbkMVis1xC51etuLGH3EJ/GpNyKTdS6SuD2MkK/6Y+8zlznR7x3Cy1vU1G2edbFgNc7NjyagEBiUk+rhMPpuf1bRGjAQW4WNYGIcKHHMlBpe8BdSEhyCsyWpLGDvIqpe+BMelNXq+zCMqBTsvkPOmkgXta3Zw3tASxXZyGAKMtwvmMT+Mop184zF+BkzGwQ3lJ+IEBH24RCBhIg7XPAIl3ldJL9i0C4/SY3vn3F8WUg0lQobEbIlbxqp/j6Q+hxVuUpoGHKm5MVu/GnV6A/lIaF8bVCzd9eP3VurttFv732f1O63kuRTiG3mlWRQlMv6xHP+SGjGKGwOl/Hi+vXLzFSU5auaIcQRq+UDnh/F24BPjXAuACf2J1Rjtb4bdw3jHcF5HEcd+V/i8AAP//1wS0ZzYoAAA=" # forces replacement
      ~ vpc_security_group_ids       = [
          - "sg-084607083aaa39727",
          - "sg-0eb65fd8f2c17dba5",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdb" -> null
          - encrypted             = true -> null
          - iops                  = 150 -> null
          - kms_key_id            = "arn:aws:kms:us-east-1:933752197999:key/9630f91f-f3c0-42eb-b65d-3defffc79926" -> null
          - tags                  = {
              - "AppCode"      = "IMGB-001"
              - "Name"         = "🏗 Internal Composer (staging)"
              - "ServiceOwner" = "Image Builder"
            } -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-058d1cec56397f102" -> null
          - volume_size           = 50 -> null
          - volume_type           = "gp2" -> null
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }


      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0d98a6edf4b062d41" -> (known after apply)
          ~ volume_size           = 25 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # aws_launch_template.worker_external_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_external_x86" {
      ~ default_version         = 5 -> (known after apply)
        id                      = "lt-0195b4ef20679c780"
      ~ latest_version          = 5 -> (known after apply)
        name                    = "imagebuilder_worker_external_x86_staging"
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🔧 External Composer Worker (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ user_data               = "H4sIAAAAAAAA/9RZ6XLjOH7/rqp5B8Tj1OxWhxIPSba866kVJVInKYmnqE3KBYKQSBEEaRI6e/tF8iVf83h5hBR1uGV3z+yRrUqNv7QI/C/88D/RnZQyTBlnHTL8BJINYVEGc1ZLoj0O/gD8dEMDmB+e77SBpsgTW++2De+uUn5xDs6LKKVPQKjyP1R+qHDcLdEPlavsblRkaRGxEy1kDKIwwZT9ASwjgilM8PNdRCNWRcvV3VcuK4e0WOKcUyhKg4iunsCDH7EbgpPJDO9ZDZF0E3Aopcto9UNFixL8jXE/3tJUKpsC58VTBQAOlBY8AYxErlysAABAUYQvcMPCNI+OOHiJ8eFEW/5x4K4oQi4vIGi3221Z0o+wIxyQqJSf3fasLbfb7U571tmvl+pgQHrLDm1FiPQPiZsrcm7ZIhk3WWz2LAFnD0FnetwJa6/p0nBGpnMtw9M80vf6nPQekTtp1Qw1kwP+2FJ3+uFTvFyFreXmoHv11uCTBpuTg+XIq0aop+p+acx7jajPUM2cEeorajTKzLhOoiytzxZMZsmq/bqKzXazewwPK7+5aWitaG8N9nVXXm9Mje/NZ0d9neHlIXI3n4qB8SkU7XwWj9ryZjPwZn6+Jp/U0EngeJtvD9ZE3BQTtqWevA796e4weRDd6Rpmo6DWCi34OlWEnXpo2qpI56g+Xe34VTTzm0Xkq9bxQbfw3pUas9bjazabuJo3QtlqkRMT9vujhamF7Dh50IJFPhmr9jw1hTZuH+qrkCE9n8gW8RvmdvogHY/8q2yoIupM6hN+lzV2u9dpuN2JlPlSZo2nLMBs+Mlp8LMpzej8YJp0kYlHdYewKPjzffOBhi1Cw3G+WK3xA0pndNpW9zVEpKZiDg+raDNF8u5TLDx6G+Jpc/sVyizeDcexse5ma2su4oY2FJpp96EY9lG95jbiw3K8DbTCCYNXoTPv9xxnkh3Tlc+3Go4X8cZczejCqAnYWXVqxifXOTBv6T3y+dKZoKCdir3Fkg4bR8+w58NhS1vEkO73kvJgT6JYGeqtwl6LPH9sdg4HfrAcvFr+UJAby4dlIEFk5ON6F3l2oA5qgnzQ3aYqrB/QImr3JsOR7h/nKm9JbPm457Ewe34GCVyn+Z9yHISQVVGa3L33dxyIjYbQOvl85+zzZNEdCLqlNMq1wVQW1iqpZ03VkqN932ruJnFz/kjXtcUDTqf6TKlp/G5Uf2yMQOpvAhi9U1bZ5RHDL2VGuIRlBln4BGosyc7h/VLmiJctzIuTZeicBZ7AXy6GTkzZHoy7L52Jpg2s50cJweUjz+OG2BDrfl2oLx+WDX/ZgJgPJNQSRPTYElrihbsz0aYTUzGu7A/LBpaaQdCqPwoNfglR3eelptREzUBq+f5DE4v4UQiWH5W3XzqKYT2PTZ6NTaFj2MHQiuSu4Qxt014MZ7xqG6c9nnViYWjahuIoenfmLuYLXpVMeygveOLYXX2mid5Rd+SeHTcEX1zwONEaVjcWjV5o+6IhB7xhuHY29oVsCPuLtRWrhmHvRjOiygG/eDUcR5/FpD+zVMewVSng95HGN7KFGhRIyLr6fLH2XV0ye+HaioXX2TyYOorTtBxjgW1BcSx9Dnv6xJpncrDLyr36u71YnVvO0Ah4h7q24dqOqhiKygeJdjDXauhIYW71+AZ2suaM12WbJ5KhqgszZls3JmmQ6JPOyeZhx7ZVZSEGqq2oyonWbXXL71ms6jMq566jeqaja94xHLtuptsOoZjKxsTWZU0YjrUkGBhdee/N1WOwXo08Z7h2Yk3UidZYxOHesO09tPeOqzxKWndo4LVzhGKWalK2t/qkb69DySbedizqQ80d7NFadrCTWR6/h5qAJMfJDrNdyutdI/Gk9GjNSd1X9aYjOAtbkOksJmPYC+RJX2WIZKbmthLPNQ6475hWhx39eKGYLqtrEsq9ozpaOM5GS/RCU4OsQxze7Q77hrDoGiTQLVHdLmIjd1Wna1BnbPaDke0GPatvHE1Fh66rJwEJXFPNoB7X6wEf7DSiQtcaNLxjKPhz+VVz2iNbWRSuotUXPRVaihC6KokMS9bNueFqij4wqSwZPNl5lGx8h9h+hx0N6oh+19g6PeGA++kWz8MmUgzRiYUpitWhP8vqvlhIiDjM6Tux0XNUWxh2LDGQNZsJni2YTt8Jzbls+Mdh7EuL/ejY3huJd5zZ9YNj63LAO/LMVSeOIvSMeTCwHaJ0yMLUlFZnRohqxKm0sBaeJsW7Ra9VILM18sgi82KSBaKxsYV2rsdCZ6IEsuY4sTkPDNcWOp6t9sx1QHSyOmJLjn1xN/oFXvnKa8wDdRa1JNte6DNb6Mxcr/79uNq/+ehslckGzURdJMTkUcNXszGKBwfLFSBU1L2pEA27+9CSiIssJBlH0rGcoW1QfedSm9f6A8kQDMnjjTRIVoJh61tTVaNOss8DS/Z0u+UteEN0+3oH9Vo9sz8UNYVNTXdv6YIz0ubeTu8VW5MQ6vZR7vcy2+lr28k82/nr0HSSPUN9e2vwwtSy7JHtDvt2h03g2oHo6CQGv5hDpS5Z1kCwXeZMusOR3w+JGauFPQ8HM3HftXtO3Y513bPUhj5vS06vQSddeWySgMeOPJvMMt4WA31G25LuOObCfeR1267bSnYwafsI+2Srq8P6xBkahsgO2NVNcx4kszgUoRTqZrLYIFGTXLMl6i4RjHXIsCI0O2ud9+K0MeKzhmGrgtlP914cCMjWvZGkjmzHsINOy/CP3iGIg7lnxw1bWIw9otU9J9Rmx+FEp+oausM9Wtv1xdpQzHg2MqleWOajhPp6A63VrT43eC8ebnQSC7O51upE55xs2A1loOiqTYyhEZPuzDHUcy7nRx8rRX9iWs9wV5QFLEsLnFfTwt9EJKim+eojcbvbNRTTfBYexKokVJv1qiBcaNyJMVKMF9Mcv4wUz3xpG/ozzOkT3BVPBUY5ZkUCKVzh/GlTcBgWjBOeWpL00BCF1kOr1bpQPfk53p16Ve5BtTEmF/mmLZsdYzC1BhP9RWvr7d6lzLX17j+urNj4BcqjrOzquQsLh9IkgTTg4plH0tZVv2dainaCS29rysvUUNTB/LlgcBXRFYf3DOcUEm6X5vGl/74BrjswnmuYodoFXO6K9lW60jEUy3w7mKJ3p5OBbr3Yxvg5ZCwrnmq19yervp2sChN4TOnlEmu3fcf3VH6zUGVpQr7fjvw5TtfRf1w+ICHpDgcvQZrAiBbgGfwZ3DEMk1uXufs3cBdu/Gp5jR/Xz9h8uwWuGhAEz+Du+1YjyKGcVTNc9lkX684C/277/ml2fEA6SWnEcvR9KH8EWrkNzrPbJoelz4FlmoNBAlcYyKUanIOIgrZrVt+4uikqnsDVB5KTjtM9n37VghRtyjn0JO68Vg1ZQipvAjohRjHAW5wfgMSDAqOUBgWANAAkXQGWguJQkHR1VVlgBgKIk5QCib9ZK4nPlF9lt0vIAUQIFwXYRrCcOQHbUIrJSTDGgIUYJNeTFynBt3rKYwUgS3MGxEdBLI267JZ/mwIDGAR5KZykCJIwLdjNPjxrD5KIPp1UfDXMwXm0PAAWQgZ2+KccA5oygCGL6KrkO5uFkzQ/gJSeviJaMEjRm32dvtIZXeIe3JeB/6Y6Wl55N0V5dz+Dh8a/3hhW3moDoAMiuLhZZiGmAO8xArVNkddOR6r5Ea1l6THN/ZS9QILzm1MotNjkZwjzNGWnp4biUDCcgKigPzGw3BDy3l51MFYuNp9Ypm2rD2q3lhcZRPjN8Ef+W8NZlLyzexexMKJA+Gcc6eyNF9+IlmCHAYIU5BiiEKCAVr/OU19jQJ9Yyu+SEB4CTH//BFwMdhEhAJIdPBRghRmAoM5LIMQ5Bj5GsPScdAkQiTBlAOGcFe9hKq8T5CEmLyigwB1YfXApbh+MuEVuCSOCbx00i+jqHwDjV0WWsVCvS7dLecpSlJJzErjZKBhkmzLP1Xnpw3WBoiAgPdW1AnwGnXY50A3UQadtKaWLXDJWHhZJDcHa+bzcBmdlYgNf/qFDveXCv3r4b5Pjv5xIfViEb5duYhqAE09R+stVTPV9Pv2pAJhuozylZRYEW5hH0Ce4ADDH4JoccXByjac31r87nf6o6M7AmOiaoltXZ57Ziq28q9CvG7zBH8rxbdtRi8pUz/nnVM9dj8RduoiLXE0xzXZPeb77n//6z/8G99pEH1gv5YBtneLzsmAqhjPoKGX2uqycfBqy62e3bSnX9w9DMe2x9Xz/O7grQPFagALTgEtwccoCHHcynNvkBNy/nQpwVwLOT4MDuLu/GHb3+4tUjMIU3J9lVyr5hqIkOD97oDBJA/Bp/zf4zJmUf+D5j0WUA+dchxgBmJa3CjiOprtzOfmVp9q/59F1zxUhJuTcBf7Sq+uNd5ZVi8ObFGRRhsvorRTpJkf4+288lR9BD7N35QUMutXKQDettt5RXgbd5/vfoRJ4blyc3PKpVhOararYqFcv/9YIZLhgtQQzyAWQwdpVFhcFvy91tIsCJyU+ZYGkMMHVimqPx2/d6vPd/efvN7BfuPvPN8Z8uSvFTfOIMpBuzoZTvLuRe7rzOxOzUyW9FKPrdhmn95/fqf5SPYk0Lyh8YKhWrr/KSy4w495E3b8T89u47Qs456HCLwF6u3WWAqOvn8Ew8CoqGM7f+8UpbZc0lQ9Bc4rZd71/WfK48xK3hWSDwb+X8cJhGmRpRNk5kj//2lTx5cJykRIFJf1fmbG+gL+A9SvgcnBXNU98JssjuroDP58BuR2nXi62vlzGqeq6SGnlyv5rlHd/ozDwF3C6pDwB3PJvNaDyvZHv8v85gOPghqW/JV/r4oykB1DOy6ficB5tirOfXTZLL7uOL6DTPrVD0TJCkOFqxYcFbtYBFwAO/PGPfwT3nz+8An8BP4P7z7eT7JebGeiX1MT4cJow3un6//Lr77xN/FVXPgN5eoh477lfN+6+T3l2yzdQv0XvzMDF+HBC8INglLP/o+Dr1dzExTen+e25+Kk5KKvDdxy9rC6b7Iak8iOwJt3J+5mBYhyUeRildIvzsh5Fp86yq5ugLLE52JW97g4DAjcUhdUKguwUFHc3SF/GhC+36JdV6ssd+PnnWxN+QxBfy/kmu+AKCpxvI4Qv+E5znJX99MfHkJ8KkOMkZfgj2yn2ixTFuBy8fqGNu0o7i7i8nP3pI6xPjw88/w2YHPdD5X8DAAD//7q77132HwAA" -> (known after apply)
        # (8 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_launch_template.worker_internal_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_internal_x86" {
      ~ default_version         = 5 -> (known after apply)
        id                      = "lt-0a23e96f3feb1649c"
      ~ latest_version          = 5 -> (known after apply)
        name                    = "imagebuilder_worker_internal_x86_staging"
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🔧 Internal Composer Worker (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ user_data               = "H4sIAAAAAAAA/9RZ6XLjOH7/rqp5B8Tj1OxWhxIPSba866kVJVInKYmnqE3KBYKQSBEEaRI6e/tF8iVf83h5hBR1uGV3z+yRrUqNv7QI/C/88D/RnZQyTBlnHTL8BJINYVEGc1ZLoj0O/gD8dEMDmB+e77SBpsgTW++2De+uUn5xDs6LKKVPQKjyP1R+qHDcLdEPlavsblRkaRGxEy1kDKIwwZT9ASwjgilM8PNdRCNWRcvV3VcuK4e0WOKcUyhKg4iunsCDH7EbgpPJDO9ZDZF0E3Aopcto9UNFixL8jXE/3tJUKpsC58VTBQAOlBY8AYxErlysAABAUYQvcMPCNI+OOHiJ8eFEW/5x4K4oQi4vIGi3221Z0o+wIxyQqJSf3fasLbfb7U571tmvl+pgQHrLDm1FiPQPiZsrcm7ZIhk3WWz2LAFnD0FnetwJa6/p0nBGpnMtw9M80vf6nPQekTtp1Qw1kwP+2FJ3+uFTvFyFreXmoHv11uCTBpuTg+XIq0aop+p+acx7jajPUM2cEeorajTKzLhOoiytzxZMZsmq/bqKzXazewwPK7+5aWitaG8N9nVXXm9Mje/NZ0d9neHlIXI3n4qB8SkU7XwWj9ryZjPwZn6+Jp/U0EngeJtvD9ZE3BQTtqWevA796e4weRDd6Rpmo6DWCi34OlWEnXpo2qpI56g+Xe34VTTzm0Xkq9bxQbfw3pUas9bjazabuJo3QtlqkRMT9vujhamF7Dh50IJFPhmr9jw1hTZuH+qrkCE9n8gW8RvmdvogHY/8q2yoIupM6hN+lzV2u9dpuN2JlPlSZo2nLMBs+Mlp8LMpzej8YJp0kYlHdYewKPjzffOBhi1Cw3G+WK3xA0pndNpW9zVEpKZiDg+raDNF8u5TLDx6G+Jpc/sVyizeDcexse5ma2su4oY2FJpp96EY9lG95jbiw3K8DbTCCYNXoTPv9xxnkh3Tlc+3Go4X8cZczejCqAnYWXVqxifXOTBv6T3y+dKZoKCdir3Fkg4bR8+w58NhS1vEkO73kvJgT6JYGeqtwl6LPH9sdg4HfrAcvFr+UJAby4dlIEFk5ON6F3l2oA5qgnzQ3aYqrB/QImr3JsOR7h/nKm9JbPm457Ewe34GCVyn+Z9yHISQVVGa3L33dxyIjYbQOvl85+zzZNEdCLqlNMq1wVQW1iqpZ03VkqN932ruJnFz/kjXtcUDTqf6TKlp/G5Uf2yMQOpvAhi9U1bZ5RHDL2VGuIRlBln4BGosyc7h/VLmiJctzIuTZeicBZ7AXy6GTkzZHoy7L52Jpg2s50cJweUjz+OG2BDrfl2oLx+WDX/ZgJgPJNQSRPTYElrihbsz0aYTUzGu7A/LBpaaQdCqPwoNfglR3eelptREzUBq+f5DE4v4UQiWH5W3XzqKYT2PTZ6NTaFj2MHQiuSu4Qxt014MZ7xqG6c9nnViYWjahuIoenfmLuYLXpVMeygveOLYXX2mid5Rd+SeHTcEX1zwONEaVjcWjV5o+6IhB7xhuHY29oVsCPuLtRWrhmHvRjOiygG/eDUcR5/FpD+zVMewVSng95HGN7KFGhRIyLr6fLH2XV0ye+HaioXX2TyYOorTtBxjgW1BcSx9Dnv6xJpncrDLyr36u71YnVvO0Ah4h7q24dqOqhiKygeJdjDXauhIYW71+AZ2suaM12WbJ5KhqgszZls3JmmQ6JPOyeZhx7ZVZSEGqq2oyonWbXXL71ms6jMq566jeqaja94xHLtuptsOoZjKxsTWZU0YjrUkGBhdee/N1WOwXo08Z7h2Yk3UidZYxOHesO09tPeOqzxKWndo4LVzhGKWalK2t/qkb69DySbedizqQ80d7NFadrCTWR6/h5qAJMfJDrNdyutdI/Gk9GjNSd1X9aYjOAtbkOksJmPYC+RJX2WIZKbmthLPNQ6475hWhx39eKGYLqtrEsq9ozpaOM5GS/RCU4OsQxze7Q77hrDoGiTQLVHdLmIjd1Wna1BnbPaDke0GPatvHE1Fh66rJwEJXFPNoB7X6wEf7DSiQtcaNLxjKPhz+VVz2iNbWRSuotUXPRVaihC6KokMS9bNueFqij4wqSwZPNl5lGx8h9h+hx0N6oh+19g6PeGA++kWz8MmUgzRiYUpitWhP8vqvlhIiDjM6Tux0XNUWxh2LDGQNZsJni2YTt8Jzbls+Mdh7EuL/ejY3huJd5zZ9YNj63LAO/LMVSeOIvSMeTCwHaJ0yMLUlFZnRohqxKm0sBaeJsW7Ra9VILM18sgi82KSBaKxsYV2rsdCZ6IEsuY4sTkPDNcWOp6t9sx1QHSyOmJLjn1xN/oFXvnKa8wDdRa1JNte6DNb6Mxcr/79uNq/+ehslckGzURdJMTkUcNXszGKBwfLFSBU1L2pEA27+9CSiIssJBlH0rGcoW1QfedSm9f6A8kQDMnjjTRIVoJh61tTVaNOss8DS/Z0u+UteEN0+3oH9Vo9sz8UNYVNTXdv6YIz0ubeTu8VW5MQ6vZR7vcy2+lr28k82/nr0HSSPUN9e2vwwtSy7JHtDvt2h03g2oHo6CQGv5hDpS5Z1kCwXeZMusOR3w+JGauFPQ8HM3HftXtO3Y513bPUhj5vS06vQSddeWySgMeOPJvMMt4WA31G25LuOObCfeR1267bSnYwafsI+2Srq8P6xBkahsgO2NVNcx4kszgUoRTqZrLYIFGTXLMl6i4RjHXIsCI0O2ud9+K0MeKzhmGrgtlP914cCMjWvZGkjmzHsINOy/CP3iGIg7lnxw1bWIw9otU9J9Rmx+FEp+oausM9Wtv1xdpQzHg2MqleWOajhPp6A63VrT43eC8ebnQSC7O51upE55xs2A1loOiqTYyhEZPuzDHUcy7nRx8rRX9iWs9wV5QFLEsLnFfTwt9EJKim+eojcbvbNRTTfBb4qsRXhceqIFxI3IkxUowX0xy/jBTPfGkb+jPM6RPcFU8FRjlmRQIpXOH8aVNwGBaME55akvTQEIXWQ6vVulA9+TnenVpV7kG1MSYX+aYtmx1jMLUGE/1Fa+vt3qXKtfXuP66s2PgFyqOsbOq5CwuH0iSBNODimUfS1lW/Z1qKdkJLb2vKy9RQ1MH8uWBwFdEVF1GGcwoJt0vz+NJ+3+DWHRjPNcxQ7YItdwX7Kl3pGIplvh1M0bvTyUC3Xmxj/BwylhVPtdo2Q5jjA0ESGnWJbzbqLV9AAdc67vOHY2NbfX/y6tvJqyVjFSbwmNLLRddue5Pv2fXNQpWlCfl+y/LnOF1H/3H5gISkOxy8BGkCI1qAZ/BncMcwTG7d6u7fwF248avlXX9cPwP47Ra4akAQPIO771uNIIdyVs1w2YtdrDsL/Lvt+6fZ8QHpJKURy9H3ofwRaOU2OM93mxyWjgmWaQ4GCVxhIJdqcA4iCtquWX3j6qaoeAJXR0lOOk73fPpVC1K0KWfVk7jzWjVkCam8CeiEGMUAb3F+ABIPCoxSGhQA0gCQdAVYCopDQdLVVWWBGQggTlIKJP5mrSQ+U36V3S4hBxAhXBRgG8FyLgVsQykmJ8EYAxZikFxPXqQE3+opjxWALM0ZEB8FsTTqslv+bQoMYBDkpXCSIkjCtGA3+/CsPUgi+nRS8dUwB+fR8gBYCBnY4Z9yDGjKAIYsoquS72wWTtL8AFJ6+opowSBFb/Z1+kpndEkO4L7MDm+qo+WVd1OUd/czeGj8641h5a02ADoggoubZRZiCvAeI1DbFHntdKSaH9Falh7T3E/ZCyQ4vzmFQotNfoYwT1N2eo4oDgXDCYgK+hMDyw0h7+1VB2PlYvOJZdq2+qB2a3mRQYTfDH/kvzWcRck7u3cRCyMKhH/Gkc7eePGNaAl2GCBIQY4hCgEKaPXrzPU1BvSJpfwuCeEhwPT3T8DFYBcRAiDZwUMBVpgBCOq8BEKcY+BjBEvPSZcAkQhTBhDOWfEepvI6QR5i8oICCtyB1QeXAvjBiFvkljAi+NZBs4iu/gEwflVkGQv1unS7lKcsRSk5J4GbjYJBtinzXJ2XPlwXKAoC0lPxK8Bn0GmXQ99AHXTallK6yCVj5WGR1BCsnc/LbXBWJjbw5R861Fsu/KuH/zY5/suJ1IdF+HbpJqYBOPEUpb9cxVTf59OfCoDpNspTWmZBsIV5BH2CCwBzDK7JEQcn13h6Y/270+mPiu4MjImuKbp1deaZrdjKuzL+usGbj+X4tjepRWWq5/xzqueuR+IurcZFrqaYZrunPN/9z3/953+De22iD6yXcgi3TvF5WTAVwxl0lDJ7XVZOPg3Z9bPbtpTrG4mhmPbYer7/HdwVoHgtQIFpwCW4OGUBjjsZzm1yAu7fTgW4KwHnp8EB3N1fDLv7/UUqRmEK7s+yK5V8Q1ESnJ9GUJikAfi0/xt85kzKP/D8xyLKgXOuQ4wATMtbBRxH0925nPzKc+7f8zC754oQE3JuFX/pZfbGO8uqxeFNCrIow2X0Vop0kyP8/Xegyo+gh9m78gIG3WploJtWW+8oL4Pu8/3vUAk8Ny5ObvlUqwnNVlVs1KuXf2sEMlywWoIZ5ALIYO0qi4uC35c62kWBkxKfskBSmOBqRbXH47eW9vnu/vP3u9wv3P3nG2O+3JXipnlEGUg3Z8Mp3t3IPd35nYnZqZJeitF1u4zT+8/vVH+pnkSaFxQ+MFQr11/lJReYcW+i7t+J+W3c9gWc8+ThlwC93TpLgdHXz2AYeBUVDOfv/eKUtkuayoegOcXsuwGgLHnceYnbQrLB4N/LeOEwDbI0ouwcyZ9/bfT4cmG5SImCkv6vDGJfwF/A+hVwObirmic+k+URXd2Bn8+A3M5cLxdbXy4zV3VdpLRyZf81yru/URj4CzhdUp4Abvm3GlD53lx4+T8fwHFww9Lfkq91cUbSAyiH6lNxOI82xdnPLpull13HF9Bpn9qhaBkhyHC14sMCN+uACwAH/vjHP4L7zx9eir+An8H959tx98vNDPRLamJ8OE0Y73T9f/n1dx4w/qorn4E8vVa899yvG3ffpzy75Ruo36J3ZuBifDgh+EEwytn/UfD1am7i4pvT/PZc/NQclNXhO45eVpdNdkNS+RFYk+7k/cxAMQ7KPIxSusV5WY+iU2fZ1U1Qltgc7Mped4cBgRuKwmoFQXYKirsbpC9jwpdb9Msq9eUO/PzzrQm/IYiv5XyTXXAFBc63EcIXfKc5zsp++uNjyE8FyHGSMvyR7RT7RYpiXA5ev9DGXaWdRVye1/70Edanxwee/wZMjvuh8r8BAAD//wU1W8oaIAAA" -> (known after apply)
        # (8 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_spot_fleet_request.workers_external_x86 must be replaced
-/+ resource "aws_spot_fleet_request" "workers_external_x86" {
      ~ client_token                        = "terraform-20210128104135951500000004" -> (known after apply)
      ~ id                                  = "sfr-c97e566a-9631-467b-af70-d2b5ac0e4b93" -> (known after apply)
      ~ load_balancers                      = [] -> (known after apply)
      ~ spot_request_state                  = "active" -> (known after apply)
        tags                                = {
            "AppCode"      = "IMGB-001"
            "Name"         = "External worker fleet - staging"
            "ServiceOwner" = "Image Builder"
        }
      ~ target_group_arns                   = [] -> (known after apply)
        # (10 unchanged attributes hidden)

      - launch_template_config { # forces replacement
          - launch_template_specification {
              - id      = "lt-0195b4ef20679c780" -> null
              - version = "5" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
        }
      + launch_template_config { # forces replacement
          + launch_template_specification {
              + id      = "lt-0195b4ef20679c780"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
        }
    }

  # aws_spot_fleet_request.workers_internal_x86 must be replaced
-/+ resource "aws_spot_fleet_request" "workers_internal_x86" {
      ~ client_token                        = "terraform-20210128104115148500000002" -> (known after apply)
      ~ id                                  = "sfr-efe331f8-621f-4e5e-a877-70c53606e343" -> (known after apply)
      ~ load_balancers                      = [] -> (known after apply)
      ~ spot_request_state                  = "active" -> (known after apply)
        tags                                = {
            "AppCode"      = "IMGB-001"
            "Name"         = "Image Builder internal worker fleet - staging"
            "ServiceOwner" = "Image Builder"
        }
      ~ target_group_arns                   = [] -> (known after apply)
        # (10 unchanged attributes hidden)

      - launch_template_config { # forces replacement
          - launch_template_specification {
              - id      = "lt-0a23e96f3feb1649c" -> null
              - version = "5" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
        }
      + launch_template_config { # forces replacement
          + launch_template_specification {
              + id      = "lt-0a23e96f3feb1649c"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
        }
    }

  # aws_volume_attachment.composer_external must be replaced
-/+ resource "aws_volume_attachment" "composer_external" {
      ~ id          = "vai-2791961468" -> (known after apply)
      ~ instance_id = "i-0351a00a6c8e78e4f" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_volume_attachment.composer_internal must be replaced
-/+ resource "aws_volume_attachment" "composer_internal" {
      ~ id          = "vai-4287198256" -> (known after apply)
      ~ instance_id = "i-029e28b87a6e5ad32" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 6 to add, 2 to change, 6 to destroy.
```

</details>

*Pusher: @ondrejbudai, Action: `pull_request`*